[
  {
    "title": "Rayen Hamlaouia,*, Atefeh Gooran Orimia, Reem Doniaa, Christian Backeb, Veit Brikenb, Roland Lachmayera",
    "year": "Year",
    "link": "PID/web link",
    "measure": "TA/Measure/SeedFund",
    "authors": "Authors (full names)",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "A survey on the dissemination and usage of research data management and related tools in German engineering sciences",
    "year": 2024,
    "link": "https://preprints.inggrid.org/repository/view/26/",
    "measure": "TA Frank",
    "authors": "Tobias Hamann   , Amelie Metzmacher, Patrick Mund, Marcos Alexandre Galdino   , Anas Abdelrazeq   , Robert Heinrich Schmitt",
    "abstract": "As the amount of collected and analysed data increases, a need for data management arises to ensure its usability. This also applies in research. This challenge can be addressed by Research Data Management (RDM), which brings clear focus on the reusability of data. To understand the status quo of the application of research data management in engineering sciences in Germany, as well as possible challenges and improvement chances, a survey was conducted over the last quartal of 2020. Over 168 (n=168) researchers from the engineering sciences in Germany provided their view via a questionnaire that contains 216 question items. The results give intel on the interviewees knowledge and perceived relevance of research data management in their daily research activities. For instance, the application of research data management related tasks, data sharing with third parties, usage of different tools, and the involvement of different file formats were part of the survey. The survey closed with questions regarding RDM specifications, support structures, and questions on reasons that could prevent researchers from adapting sustainable RDM. This paper presents the results of the study, providing an overview over the current RDM in engineering and pointing out possible measures and strategies to foster it, namely the integration of guidance and education for research data management. Along the paper, we publish the collected data set to enable further analysis and reuse (e.g. for extended statistical analysis). ([preprints.inggrid.org](https://preprints.inggrid.org/repository/view/26/?utm_source=openai))"
  },
  {
    "title": "Leveraging measurement data quality by adoption of the FAIR guiding principles",
    "year": 2024,
    "link": "https://doi.org/10.1515/teme-2024-0040",
    "measure": "TA Frank",
    "authors": "Schmitt, Robert H., Bodenbenner, Matthias, Hamann, Tobias, Sanders, Mark P., Moser, Mario and Abdelrazeq, Anas",
    "abstract": "I'm unable to locate the abstract for the article titled \"Leveraging measurement data quality by adoption of the FAIR guiding principles\" with DOI 10.1515/teme-2024-0040. The article is published in the journal *tm - Technisches Messen*, Volume 91, Issue 9, 2024, on pages 441-453."
  },
  {
    "title": "Matching Data Life Cycle and Research Processes in Engineering Sciences",
    "year": 2024,
    "link": "https://preprints.inggrid.org/repository/view/42/",
    "measure": "TA Frank",
    "authors": "Tobias Hamann M.Sc.   , Michèle Robrecht, Max Leo Wawer   , Jonas Maximilian Werheid   , Mario Moser, Marcos Alexandre Galdino   , Anas Abdelrazeq   , Roland Lachmayer, Robert Schmitt",
    "abstract": "Research data management (RDM) has become increasingly significant, focusing on ensuring the most benefit from data creation. This especially applies within the engineering sciences, where many different sources generate big amounts of heterogeneous data. However, integrating RDM into day-to-day work is difficult. Thus, methods need to be defined to effectively and conveniently manage research data with increased complexity and diversity of subdisciplines. This article aims to provide clarity and structure in research processes integrating RDM, considering various models and viewpoints to present a research process for engineering sciences that is inherited from RDM processes. Therefore, interviews and workshops in different formats were used to gather insights about requirements in day-to-day work and research processes. As for further steps, the process will be evaluated on a later stage through a validation survey that will be taken into implementation for the Joint Assistant for Research in Versatile Engineering Sciences (Jarves)."
  },
  {
    "title": "Demonstration: Solving Archetype Frank's Challenges - Introducing Jarves",
    "year": 2024,
    "link": "https://zenodo.org/doi/10.5281/zenodo.12806567",
    "measure": "TA Frank",
    "authors": "Tobias Hamann M.Sc.",
    "abstract": "I'm unable to locate an abstract for the document associated with DOI 10.5281/zenodo.12806567."
  },
  {
    "title": "Jarves, the digital data steward from NFDI4Ing",
    "year": 2024,
    "link": "https://zenodo.org/doi/10.5281/zenodo.11185297",
    "measure": "TA Frank",
    "authors": "Hamann, Tobias; Robrecht, Michèle",
    "abstract": "The Zenodo record for DOI 10.5281/zenodo.11185297 does not provide an abstract. It includes a description acknowledging funding and support from the German Research Foundation (DFG) within the NFDI4Ing consortium. The record also contains a presentation file titled \"20240605_NFDI4Ing_Freiraum24_Bibliocon_Jarves_v1.0.0.pdf,\" which may offer more detailed information."
  },
  {
    "title": "Engineering RDM Survey - Dataset",
    "year": 2024,
    "link": "https://zenodo.org/doi/10.5281/zenodo.7645547",
    "measure": "TA Frank",
    "authors": "Hamann, T., Metzmacher, A. I. und Mund, P. ",
    "abstract": "I'm unable to locate an abstract for the document with DOI 10.5281/zenodo.7645547."
  },
  {
    "title": "Jarves: The Digital Data Steward for Engineering Science Research",
    "year": 2023,
    "link": "https://zenodo.org/doi/10.5281/zenodo.8378834",
    "measure": "TA Frank",
    "authors": "Hamann, T., & Werheid, J.",
    "abstract": "The abstract for the presentation titled \"Jarves: The Digital Data Steward for Engineering Science Research\" is as follows:\n\n\"Rising amounts of data and the corresponding management and demands of funding institutions lead to an increasing significance of research data management (RDM), which introduces researchers to new competencies. Researchers must therefore know what specifications they have to meet with their RDM. There is also a demand for information on which tools are available to support them, and where they can receive guidance or training materials on RDM. However, a survey conducted amongst 168 researchers showed that more than half of the interviewees do not know the FAIR principles. Over 60% do not use a data management plan for their research. To foster RDM in engineering, researchers must be informed about the possibilities and practices of successful research data management.\n\nHowever, researchers are often missing rules, guidance, or related knowledge for their RDM while facing additional effort because of missing automation and repetitive work. In the aforementioned survey, only 22% of the interviewees claimed to have access to RDM specifications, while 39% answered to not have any support at all. The latter statement shows a discrepancy between the interviewees’ perceptions and the existing solutions. For instance, several universities offer RDM support to help researchers get started on RDM. Also, there are training materials either by universities or initiatives such as the NFDI, respectively, included consortia. Conducted interviews showed that solutions and tools offered, as well as the proper usage of these, are often not known by researchers. Numerous researchers wished for more automation in research data management, as RDM itself is often perceived as an additional effort rather than as a benefit. The gap between RDM theory and research practice in the engineering community must be addressed in a way that combines guidance and applicability with existing solutions.\n\nThe high initial effort to define or research existing guidelines in RDM for researchers has to be considered along with the missing RDM knowledge amongst researchers. A new solution must be set to provide a benefit in RDM rather than more administrative work. As there are existing solutions, the goal should be to connect them rather than design a new one. To address these challenges, the status quo of RDM in engineering was surveyed, the needs of researchers were scouted via focus group interviews, and, RDM-process-related workshops were conducted. First, a survey on RDM in general and knowledge about it was performed among 168 researchers in the engineering sciences. The goal was to understand the spread and usage of RDM amongst engineering researchers. As a second step, focus group interviews were performed to identify subconsciously or consciously performed RDM tasks amongst the interviewees from engineering sciences.\n\nFor example, many manage their code via Git, which already is RDM but was often not considered as such by the interviewees. Thirdly, typical workflows and processes were collected in a workshop format. The workshops were designed to be as open as possible to not set false artificial boundaries to the researchers’ everyday work when designing an RDM process for them.\n\nLastly, a suitable solution was conceptualised, possible technical solutions were scouted, and a demonstrator was implemented. As a result, a framework, the “Joint Assistant for Research in Versatile Engineering Sciences”, or in short Jarves, was created that aims to address these challenges by providing a structured RDM process with recommendations regarding tools and training materials and partial automation. It is designed as a digital data steward, specifically for research data management in engineering. Jarves provides a guideline for RDM that can be tailored to the specific RDM rules of the researchers’ university, institute, or funding institution. The so structured process guides researchers through their everyday research data management, supporting them not only with steps and tasks to perform but also practical solutions and training materials for RDM issues, readily accessible at the point of need.\n\nJarves’ integrated decision support considers multiple factors for the hints it provides. For example, not only the institution’s RDM guideline influences the archiving solution. The specific disciplines involved, the amount of data collected, and\"\n\nThe abstract is truncated in the provided source."
  },
  {
    "title": "A survey on the dissemination and usage of research data management and related tools in German engineering sciences",
    "year": 2024,
    "link": "https://doi.org/10.48694/inggrid.4073",
    "measure": "TA Frank",
    "authors": "Tobias Hamann   , Amelie Metzmacher, Patrick Mund, Marcos Alexandre Galdino   , Anas Abdelrazeq   , Robert Heinrich Schmitt",
    "abstract": "As the amount of collected and analysed data increases, a need for data management arises to ensure its usability. This also applies in research. This challenge can be addressed by Research Data Management (RDM), which focuses on the reusability of data. To answer the research question “What is the current status of RDM the field of mechanical and industrial engineering in German Engineering Sciences?”, an exploratory survey was conducted over the last quarter of 2020. This survey depicts the status quo of RDM in engineering sciences in Germany, as well as challenges and improvement chances. 168 (n=168) researchers from the engineering sciences in Germany provided their view via a questionnaire that contains 39 questions. The results give insights on the interviewees’ knowledge and perceived relevance of RDM in their daily research activities. Key findings are the need of researchers in mechanical and industrial engineering, especially guidance and support regarding RDM. Additionally, some main reasons against RDM (missing knowledge and additional effort) could be identified. The survey closed with questions regarding reasons that could prevent researchers from adapting sustainable RDM. This paper provides a qualitative overview over the current RDM in engineering and pointing out possible strategies to foster it, namely the integration of guidance and education for RDM. Along the paper we publish the collected data set to enable further analysis and reuse."
  },
  {
    "title": "Research Data Management Framework - POC-Study: Guideline and protocol",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.14205127",
    "measure": "TA Frank",
    "authors": "Hamann, Tobias; Robrecht, Michèle",
    "abstract": "The dataset titled \"Research Data Management Framework - POC-Study: Guideline and protocol\" is associated with the paper \"Proof-Of-Concept-Studie für das FDM in den Ingenieur:innenwissenschaften Ein Forschungsdatenmanagement-Rahmenwerk\" by T. Hamann, C. Florides, A. Abdelrazeq, and R. H. Schmitt. The dataset includes guidelines and protocols developed as part of a proof-of-concept study to validate a research data management framework in engineering sciences, specifically using the KIOptiPack research project. The authors acknowledge funding and support from the German Research Foundation (DFG) under project number 442146713."
  },
  {
    "title": "Meet the digital data steward Jarves",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.14162654",
    "measure": "TA Frank",
    "authors": "Hamann, T., & Werheid, J.",
    "abstract": "Researchers need guidance in their research data management (RDM). While it becomes clear that RDM grows in importance with the amount of data and new methodologies, most researchers are not sure how to manage their data accordingly. Processes, solutions, tools and services are most often not used or even not known. This applies for engineering sciences as well as other disciplines to some extent. One reason for this is that currently, the “How to” of RDM is either hidden behind abstract frameworks like the data life cycle or accessible through initiatives or helpdesks. However, both solutions lack an immediate nature, meaning that researchers do not receive help at their point of need. Instead, there is effort required to apply RDM and define it beforehand, due to additional tasks that RDM requires and the lack of knowledge researchers have. Therefore, the general structure of the RDM process has to be defined by researchers themselves. Afterwards, RDM has to be applied, resulting in enquiries for solutions or tools to be used in RDM. Lastly, the usage of these solutions or tools has to be figured out by the researchers. The digital data steward Joined Assistant in Research for Versatile Engineering Sciences (Jarves) aims to address these problems. Jarves supports engineering researchers in their everyday work. It focuses on the reduction of effort and time for RDM. By ordering the RDM activities based on their occurrence in the engineering research process, Jarves provides a structure for RDM in engineering. Based on the research’s general environment, like requirements of funding organisations or institutional boundaries, the next steps, available tools and suitable trainings are recommended. Its partial automation reduces the effort needed in everyday RDM, allowing for seamless (meta)data exchange. While the tool was developed for engineering sciences, researchers in other domains can apply its concepts and possibly transfer them to their needs. The proposed contribution is set to inform the members of the NFDI about Jarves and its goals, collect feedback and connect to similar solutions in the NFDI. Participants will be introduced to the digital data steward Jarves with a short presentation on the aim and scope of the tool. Afterwards, participants will be able to log in to Jarves, test the tool and collaborate with each other. The participants will be questioned for their possible applications and wishes for Jarves further development. This step aims for the identification of requirements to enhance Jarves' functionality beyond NFDI4Ing, eventually integrating it into Base4NFDI and the EOSC Service portfolio. Keywords: Engineering, RDM Process, decision support, service interconnection, RDM framework"
  },
  {
    "title": "Sketching ways towards RDM at an institute scale",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.13751713",
    "measure": "TA Frank",
    "authors": "Schmitt, Robert H., Hamann, Tobias",
    "abstract": "The Zenodo record for DOI 10.5281/zenodo.13751713, titled \"Sketching ways towards RDM at an institute scale,\" does not provide an abstract. The description mentions acknowledgments for funding and support within the NFDI4Ing consortium, funded by the German Research Foundation (DFG) under project number 442146713."
  },
  {
    "title": "Ein Forschungsdatenmanagement-Rahmenwerk",
    "year": 2024,
    "link": "https://doi.org/10.37544/1436-4980-2024-11-12-57",
    "measure": "TA Frank",
    "authors": "T. Hamann, C. Florides, A. Abdelrazeq, R. H. Schmitt",
    "abstract": "I was unable to locate an abstract corresponding to the DOI you provided."
  },
  {
    "title": "Jarves: More guidance and less effort in RDM",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.13747295",
    "measure": "TA Frank",
    "authors": "Hamann, T., & Werheid, J.",
    "abstract": "I found the following abstract for the presentation titled \"Jarves: More guidance and less effort in RDM\":\n\n\"Researchers need guidance, processes, solutions, tools and services for their RDM, which are most often not used or even known. Jarves supports researchers in engineering sciences in their everyday work as it focuses on the reduction of effort and time on RDM. Based on your research’s boundaries, your next steps, available tools and suitable trainings are recommended by Jarves.\"\n\nThis presentation was delivered at the NFDI4Ing Conference 2024."
  },
  {
    "title": "Demonstration: Solving Archetype Frank's Challenges - Introducing Jarves",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.12806568",
    "measure": "TA Frank",
    "authors": "Hamann, T.",
    "abstract": "The Zenodo record with DOI 10.5281/zenodo.12806568 is titled \"Demonstration: Solving Archetype Frank's Challenges - Introducing Jarves.\" It is a presentation authored by Tobias Hamann from the Werkzeugmaschinenlabor der RWTH Aachen, published on July 25, 2024. The presentation was part of the NFDI4Ing CC41 Community Meeting 2024, held online on the same date. The authors acknowledge funding and support from the Federal Government, the Heads of Government of the Länder, and the Joint Science Conference (GWK) within the framework of the NFDI4Ing consortium, funded by the German Research Foundation (DFG) under project number 442146713. The presentation file, named \"20240725_NFDI4Ing_CC41_CM_Jarves_v1.0.1.pdf,\" is 1.7 MB in size and is available under the Creative Commons Attribution 4.0 International license."
  },
  {
    "title": "Workshop: Research Data Management for Data from High Performance Computing (tier 1) – Best-Practice and Applications",
    "year": 2024,
    "link": "https://zenodo.org/records/11208789",
    "measure": "TA Doris",
    "authors": "siehe: https://zenodo.org/records/11208789 ",
    "abstract": "The Zenodo record at https://zenodo.org/records/11208789 pertains to a workshop titled \"Research Data Management for Data from High Performance Computing (tier 1) – Best-Practice and Applications.\" The workshop introduces researchers to the basics of research data management (RDM) and tools available at various tier 1 HPC centers. It covers techniques for structuring, documenting, and publishing research data, as well as tools and resources that support these activities. The workshop aims to enhance bookkeeping in research, facilitate collaboration within research groups, and promote the dissemination and use of research data with external partners. Topics include hardware and storage systems at different HPC centers, data transfer tools, metadata standards, cloud storage, repositories, containerization, and FAIR data principles. The workshop is supported by the NFDI4Ing consortium and the German Research Foundation (DFG)."
  },
  {
    "title": "Coscine Applicaton Profile: HPC CFD Simulation",
    "year": 2024,
    "link": "https://coscine.rwth-aachen.de/coscine/apps/aimsfrontend/#/editor?applicationProfile=https://purl.org/coscine/ap/HPC-CFD-Simulation-profile",
    "measure": "TA Doris",
    "authors": "Benjamin Farnbacher, Friedrich Ulrich, Angel Sosa + https://git.rwth-aachen.de/nfdi4ing/metadata4ing/metadata4ing/-/blob/develop/CITATION.cff?ref_type=heads",
    "abstract": "I'm unable to retrieve the abstract for the provided link."
  },
  {
    "title": "From Ontology to Metadata: A Crawler for Script-based Workflows",
    "year": 2024,
    "link": "https://www.inggrid.org/article/id/3983/",
    "measure": "TA Doris",
    "authors": "siehe Link",
    "abstract": "The present work introduces HOMER (High Performance Measurement and Computing tool for Ontology-based Metadata Extraction and Re-use), a python-written metadata crawler that allows to automatically retrieve relevant research metadata from script-based workflows on HPC systems. The tool offers a flexible approach to metadata collection, as the metadata scheme can be read out from an ontology file. Through minimal user input, the crawler can be adapted to the user's needs and easily implemented within the workflow, enabling to retrieve relevant metadata. The obtained information can be further automatically post-processed. For example, strings may be trimmed by regular expressions or numerical values may be averaged. Currently, data can be collected from text-files and HDF5 files, as well as directly hardcoded by the user. However, the tool has been designed in a modular way, so that it allows straightforward extension of the supported file-types, the instruction processing routines and the post-processing operations."
  },
  {
    "title": "HOMER - HPMC tool for Ontology-based Metadata Extraction and Re-use",
    "year": 2023,
    "link": "https://mediatum.ub.tum.de/node?id=1694401",
    "measure": "TA Doris",
    "authors": "Benjamin Farnbacher, Yu JIAO",
    "abstract": "The document titled \"HOMER - HPMC tool for Ontology-based Metadata Extraction and Re-use\" is classified as research data and was published on February 6, 2025. The authors are affiliated with the Technical University of Munich (TUM). The document is associated with the fields of data processing, computer science, mechanical engineering, and technical mechanics, thermodynamics, and acoustics. It pertains to research data management and high-performance computing. The resource includes log files, usage data, Python code, and documentation. The data production concluded on January 20, 2025. The document is available at the following URL:\n\nUnfortunately, the abstract for this document is not available in the provided information."
  },
  {
    "title": "2024 Community Meeting CC-42: HPMC Metadata: Ontology-based Metadata Extraction and Re-use",
    "year": 2024,
    "link": "https://zenodo.org/records/14070278",
    "measure": "TA Doris",
    "authors": "Benjamin Farnbacher, Yu JIAO",
    "abstract": "The NFDI4Ing consortium has developed the ontology Metadata4Ing for a process-based description of research activities and their results as a common classification of engineering data in a taxonomic hierarchy with standardized vocabulary and procedures. In order to establish a consistent terminology for CFD workflows in high-performance computing (HPC) systems, a community based HPC-sub-ontology is being developed and improved within the framework of Metadata4Ing. An improved version of HOMER (the metadata crawler developed at TUM, https://gitlab.lrz.de/nfdi4ing/crawler/), will be introduced to read out the Metadata4Ing ontology together with the HPMC sub-ontology and retrieve metadata from CFD studies. In addition, a corresponding (simplified) metadata profile for CFD simulations has been set up in the research data management platform Coscine; its use will be explained during the presentation."
  },
  {
    "title": "2024 Community Meeting CC-42: MARGE – the Multi-Access Research Gateway for HPC Experts",
    "year": 2024,
    "link": "https://zenodo.org/records/14070675",
    "measure": "TA Doris",
    "authors": "Benjamin Farnbacher, Yu JIAO",
    "abstract": "The abstract for the presentation titled \"2024 Community Meeting CC-42: MARGE – the Multi-Access Research Gateway for HPC Experts\" is as follows:\n\n\"HPC data are often used for a single application or publication and then archived in personal accounts at the corresponding computing centre. There is a lack of opportunities to make existing HPC data available to other researchers in compliance with the FAIR principles. Therefore, NFDI4Ing has created a platform that effectively operationalizes the accessibility and reusability of large HPC data. MARGE enables direct access to vast and immobile datasets through the cloud, facilitating their reuse. We cordially invite all engineers, who produce large data sets on (LRZ) HPC systems and want to share them with external researchers, to get to know the functionality and features or the MARGE service.\""
  },
  {
    "title": "Guidelines zum Text und Data Mining für Forschungszwecke in Deutschland",
    "year": 2022,
    "link": "https://oa.tib.eu/renate/handle/123456789/10352",
    "measure": "S-7-2",
    "authors": "Elke Brehm",
    "abstract": "I'm unable to locate the abstract for the document at https://oa.tib.eu/renate/handle/123456789/10352."
  },
  {
    "title": "Full Text Conversion Service",
    "year": 2023,
    "link": "https://www.ulb.tu-darmstadt.de/die_bibliothek/einrichtungen/zeid/volltextservice.de.jsp",
    "measure": "S-7-1",
    "authors": "ULB Darmstadt",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Die FAIR Prinzipien: Quiz und Übersicht zum Einstieg",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.6647047",
    "measure": "S-6 / CC-2 / S-1-4",
    "authors": "Mario Moser",
    "abstract": "The document titled \"Die FAIR Prinzipien: Quiz und Übersicht zum Einstieg\" is a presentation designed to introduce the FAIR principles in research data management (FDM). It comprises two main parts:\n\n1. **Quiz on FAIR Principles**: This interactive section presents statements about the FAIR principles, allowing participants to engage by determining their validity (true/false). This format aims to actively involve both experienced and new participants, enhancing retention through active participation. Each statement is followed by explanations and literature references to provide deeper insights.\n\n2. **Overview of the 15 Guiding Principles**: This section outlines and briefly explains the 15 guiding principles as defined by Wilkinson et al. (2016), detailing what it means to make a digital object Findable, Accessible, Interoperable, and Reusable.\n\nThe presentation is formatted for use with standard PDF viewers and is suitable for both group presentations and self-study. It was developed as part of the National Research Data Infrastructure for Engineering Sciences (NFDI4Ing) and was featured in the 5th meeting of the Special Interest Group \"Quality Assurance & FAIR Metrics\" on June 10, 2022. The author acknowledges funding and support from the German Research Foundation (DFG) under project number 442146713.\n\nThe full presentation is available for download at:\n\nFor more information on the Special Interest Group \"QA & Metrics,\" visit:"
  },
  {
    "title": "Service: Education GitLab with Self-Study RDM Training Materials",
    "year": 2022,
    "link": "https://git.rwth-aachen.de/nfdi4ing/education/",
    "measure": "S-6 / CC-2",
    "authors": "Mario Moser; Ute Trautwein-Bruns; Manuela Richter; Tobias Hamann; Janna Neumann; Kerstin Wedlich-Zachodin; David Hecker; Christian Langenbach",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Working Group Charter Training Infrastructures",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.6478698",
    "measure": "S-6 / CC-2",
    "authors": "Peter Pelz, Sonja Herres-Pawlis, Johannes Liermann, Florian Strauß, David Ohse, Norbert Kockmann, Michael Liebau, Daniel Tschink, Jens Dierkes, Justine Vandendorpe, Rabea Müller, Konrad Förstner, Tobias Hamann, Carsten Keßler, Jan-Ocko Heuer, Daniela Hausen, Kristin Sauerland, Aletta Bonn, Andreas Münzmay, … Tanja Hörner",
    "abstract": "I found the following description for the document associated with DOI 10.5281/zenodo.6478698:\n\n\"Data literacy from the very beginning! With this dictum, we firstly emphasize the importance of education in data literacy of all stakeholders in research and university teaching. Secondly, our paradigm reveals the path to sustainability of research data management (RDM). With 'data literacy from the very beginning' we contribute to the advancement of scientific methods and good scientific practice: Education in data literacy enables improved formal quality of 'data' as a modern resource to a degree where it can be used for both new insights and sustainable solutions to societal challenges. This is achieved by means of transparency and traceability for all stakeholders in an open or also protected data space.\"\n\nThis description is available on the Zenodo page for the document:"
  },
  {
    "title": "Anforderungen der Förderer im FDM",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.6341609",
    "measure": "S-6 / CC-2",
    "authors": "Neumann, Janna, Moser, Mario, Trautwein-Bruns, Ute, & Hecker, David",
    "abstract": "The document titled \"Anforderungen der Förderer im FDM\" is a presentation authored by Janna Neumann, Mario Moser, Ute Trautwein-Bruns, and David Hecker. It was published on March 9, 2022, and is available at https://doi.org/10.5281/zenodo.6341609. The description of the document is as follows:\n\n\"Dass FDM zunehmend an Bedeutung gewinnt, zeigt sich auch an den Bedingungen von Fördergebern: Neben der inhaltlichen Bearbeitung werden zunehmend FDM-Aktivitäten für eine Förderung gefordert. In diesem Vortrag werden gängige Forderungen und die zugehörigen Hilfsmittel vorgestellt.\"\n\nThis translates to:\n\n\"The increasing importance of research data management (FDM) is also evident in the requirements of funding agencies: In addition to the substantive work, FDM activities are increasingly required for funding. This presentation introduces common requirements and associated tools.\"\n\nThe document is licensed under the Creative Commons Attribution 4.0 International license."
  },
  {
    "title": "Persönliches Datenmanagement",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.6326065",
    "measure": "S-6 / CC-2",
    "authors": "Trautwein-Bruns, Ute, Moser, Mario, Neumann, Janna, & Hecker, David",
    "abstract": "The document titled \"Persönliches Datenmanagement\" is a presentation that outlines the responsibilities researchers have in managing research data. It highlights key milestones and tasks essential for effective data management. The authors express gratitude to federal and state governments, as well as the Joint Science Conference (GWK), for their support through the NFDI4Ing consortium. The project is funded by the German Research Foundation (DFG) under project number 442146713."
  },
  {
    "title": "NFDI4Ing Technical Mission Statement",
    "year": 2021,
    "link": "https://mission-statement.nfdi4ing.de/",
    "measure": "S-5",
    "authors": "Gerald Jagusch, Marius Politze, Rainer Stotzka",
    "abstract": "The NFDI4Ing mission statement emphasizes fostering quality-controlled measures for research data management in engineering sciences, ensuring long-term preservation of research data, promoting semantic interoperability through terminology services, coordinating identity infrastructures and service specifications within NFDI, and uniting engineering communities to facilitate training and education for future scientists. ([mission-statement.nfdi4ing.de](https://mission-statement.nfdi4ing.de/?utm_source=openai))"
  },
  {
    "title": "Concept for Setting up a Working Group in the NFDI Section \"Common Infrastructures\"",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.6421866",
    "measure": "S-5",
    "authors": "Wolfgang Pempe, Marius Politze",
    "abstract": "The document titled \"Concept for Setting up a Working Group in the NFDI Section 'Common Infrastructures'\" does not include an abstract. However, the description provides an overview of the working group's objectives and planned milestones. The Working Group Identity and Access Management (IAM) aims to consolidate processes, policies, and architectures to facilitate the management of digital identities and federated access to resources within and across the NFDI consortia. The working group follows three main objectives:\n\n- Conceptional work including the evaluation and creation of blueprints, especially the AARC BPA, to establish an AAI for the \"one NFDI\" as well as concepts for the integration of existing tools and resources in this infrastructure\n- Connecting NFDI AAI and the NFDI consortia with relevant initiatives on state, national, and international levels.\n- Consulting to support communities and resource providers to connect to the “one NFDI AAI”.\n\nOver the course of the next two years, the working group will follow milestones to (1) provide short-term AAI guidelines that allow service providers within the NFDI to connect their services to existing AAI infrastructures, (2) build a baseline scheme for an identity space to exchange informational attributes about identities, (3) establish role and group management services, and finally (4) provide an IAM architecture for the \"one NFDI\"."
  },
  {
    "title": "Service: Geo-Redundant Cloud Storage for Research Data with DFN-AAI and ORCID based access (RDS.NRW)",
    "year": 2022,
    "link": "https://docs.coscine.de/de/projects/storage/",
    "measure": "S-4, S-5",
    "authors": "Petar Hristov, Marius Politze",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Conceptual map of TA-MDI Results",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000159210",
    "measure": "S-4, S-5",
    "authors": "Rossella Aversa, Gulzaure Abdildina, Sabrine Chelbi, Felix Ernst, Thomas Jejkal, Reetu Joseph, Ajay Kirar, Philipp Ost, Andreas Pfeil, Yusra Shakeel, Rainer Stotzka, Elias Vitali, Katharina Grünwald, Sirieam Hunke, Amirreza Moghaddam, Marius Politze",
    "abstract": "The poster shows a conceptual map of the results offered or under development in the Task Area Materials Data Infrastructure (TA-MDI) of the NFDI-MatWerk consortium. The results are associated to the most relevant Participant Projects (PPs) and Infrastructure Use Cases (IUCs) in which they have been already adopted or they are planned to be used in future. In this way, a structured overview of the TA-MDI contributions is depicted."
  },
  {
    "title": "A Lightning Introduction to the NFDI4Ing Data Collections Explorer",
    "year": 2024,
    "link": "https://doi.org/10.5445/IR/1000168463",
    "measure": "S-4, S-5",
    "authors": "Philipp Ost",
    "abstract": "These are slides for a short lightning talk given at the TS4NFDI online workshop on 15. February 2024. They give a very short introduction to what the Data Collections Explorer is and the current state of the work."
  },
  {
    "title": "Data Collections Explorer",
    "year": 2022,
    "link": "https://rxp.datamanager.kit.edu/",
    "measure": "S-4",
    "authors": "Philipp Ost",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Overview of (Metadata) Repository Platforms",
    "year": 2021,
    "link": "https://kit-data-manager.github.io/repository-platforms/",
    "measure": "S-4",
    "authors": "Volker Hartmann, Philipp Ost",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Metadata Standards Catalog",
    "year": 2021,
    "link": "https://msc.datamanager.kit.edu/",
    "measure": "S-4",
    "authors": "Philipp Ost, Rainer Stotzka",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Data Collections Explorer",
    "year": 2022,
    "link": "https://doi.org/10.5445/IR/1000151429",
    "measure": "S-4",
    "authors": "Philipp Ost",
    "abstract": "For research data to be used efficiently, it must be easy to find and access. This is a requirement in all areas of science. The Data Collections Explorer, developed within NFDI4Ing for the engineering sciences, targets these needs. It is an information system that provides an overview of research data repositories, archives, databases as well as individual datasets published in the field. Two use cases are considered:\n\n1. Scientists searching for data sets. Are there datasets available to aid in your research? Are there benchmarks available to check your results? Are these datasets available under an open access license?\n\n2. Scientists aiming to publish data sets: Among community-specific repositories, which ones are suitable to publish the research data? Do repositories restrict the size of the datasets that can be uploaded and if so, what are the limits? Are publication fees charged and if so, how much is charged?\n\nTo facilitate answering these questions, the Data Collections Explorer provides both a free text search and filters for type of service, subject area, and access license. Where appropriate and available, information on data size limits and publishing fees is provided.\n\nThe Data Collections Explorer complements re3data, as it includes entries which are outside its scope or which are not listed.\n\nThis concept is not limited to the engineering sciences. To broaden the impact, we are currently working on expanding the Data Collections Explorer to the material sciences and engineering community within NFDI-MatWerk.\n\nThis work is supported by the NFDI4Ing consortium (DFG – project number 442146713), the German Research Foundation (DFG), the research program ‘Engineering Digital Futures’ by the Helmholtz Research Association and the Helmholtz Metadata Collaboration (HMC) Platform."
  },
  {
    "title": "Service: WORM Storage for preservation of research results",
    "year": 2022,
    "link": "https://docs.coscine.de/en/rdm/resources/types/rds-worm/",
    "measure": "S-4",
    "authors": "Petar Hristov, Marius Politze",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Science Led Research Data Storage Quotation and Allocation",
    "year": 2022,
    "link": "https://docs.coscine.de/en/projects/storage/",
    "measure": "S-4",
    "authors": "Petar Hristov, Marius Politze",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Data Collections Explorer – An Easy-to-Use Tool for Sharing and Discovering Research Data",
    "year": 2023,
    "link": "https://doi.org/10.52825/cordi.v1i.405 ",
    "measure": "S-4",
    "authors": "Philipp Ost, Yusra Shakeel, Philipp Tögel",
    "abstract": "There is a wide variety of archives, databases, and repositories currently available that provide access to research data. However, basic information about these systems is often difficult to gather, such as whether there are limits to the size of data sets that can be published or whether there is any publication fee that applies. In addition to that, there are plenty of research groups publishing their research data sets independently of these infrastructures, making it difficult for scientists to find them since they are not centrally registered. Research data must be easily discoverable and accessible for scientists to use it effectively. The Data Collections Explorer [1, 2], developed within the national research data infrastructure for the engineering sciences NFDI4Ing, is an easy-to-use information system addressing these needs. It is a low threshold information system that provides an overview of research data repositories, archives, databases as well as individually published data sets. Similar systems exist in other subject areas, for example the Data Repository Finder [3] focusing on the medical, life and social sciences. Contrary to the Data Collections Explorer, the Data Repository Finder only lists repositories."
  },
  {
    "title": "Data Collections Explorer – An Easy-to-Use Tool for Sharing and Discovering Research Data",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000162287 ",
    "measure": "S-4",
    "authors": "Philipp Ost, Yusra Shakeel, Philipp Tögel",
    "abstract": "I'm unable to locate an abstract for the document associated with DOI 10.5445/IR/1000162287."
  },
  {
    "title": "A Short Introduction to the Data Collections Explorer",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000162885",
    "measure": "S-4",
    "authors": "Philipp Ost",
    "abstract": "This is a short introduction to the Data Collections Explorer presented as part of the NFDI4Ing SIG RDM Training & Education Meeting on 6.10.2023."
  },
  {
    "title": "Data Collections Explorer – An Information System for the Engineering Sciences",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000160844",
    "measure": "S-4",
    "authors": "Philipp Ost, Rainer Stotzka",
    "abstract": "The poster provides an overview of and an introduction to the Data Collections Explorer. It is an information system for engineering related resources, such as repositories, databases, archives, as well as datasets published independent of these structures. In addition, the poster describes current developments and provides an outlook on future work.\n\nThe target audience are scientists either searching for data sets or looking to publish their data sets.\n\nSeeking to share or publish their research data sets, scientists are confronted with questions such as: what is an appropriate repository for publishing the data sets? Do repositories have size restrictions with respect to the data sets that can be uploaded? What is this limit? Are publication fees charged?\n\nSearching for data sets, scientists are often confronted with questions such as: are data sets available to aid in research? Are benchmarks available to check results? Are these data sets available under an open access license?\n\nThe Data Collections Explorer is a low-threshold web service to share and discover research data. To help get an overview and answer the above questions, it provides a free-text search as well as drop-down menus to filter its entries for the following criteria:\n\n- Hosting Institution\n- Type of Service\n- Subject Area\n- Open Access\n\nA stable version is currently in use by NFDI4Ing (https://data-collections.nfdi4ing.de). The current development version features a graph-based data model. A preview version will be made available later this year. This knowledge graph can be accessed by a SPARQL interface. It provides more flexibility than the currently deployed version."
  },
  {
    "title": "Metadata Required for FAIR Digital Objects",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000164660",
    "measure": "S-4",
    "authors": "Rainer Stotzka",
    "abstract": "I'm unable to locate an abstract for the document titled \"Metadata Required for FAIR Digital Objects\" by R. Stotzka, associated with DOI 10.5445/IR/1000164660. The available information indicates that this work was presented at the International Data Week in Salzburg, Austria, from October 23 to 26, 2023. The document is accessible through the KITopen repository."
  },
  {
    "title": "How FAIR DOs Enable Interoperability",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000164659",
    "measure": "S-4",
    "authors": "Rainer Stotzka, Xin Chen, Maggie Hellström, Robert Quick",
    "abstract": "I couldn't find an abstract for the document titled \"How FAIR DOs Enable Interoperability\" associated with DOI 10.5445/IR/1000164659. The document is a presentation by R. Stotzka, Xin Chen, Maggie Hellström, and Rob Quick from the Scientific Computing Center (SCC) at the Karlsruhe Institute of Technology (KIT), presented at the \"Global Research Commons: Europe And Beyond\" conference in Gothenburg, Sweden, on March 20, 2023. The full text is available for download from the KITopen repository."
  },
  {
    "title": "IG FAIR Digital Object Fabric",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000164658",
    "measure": "S-4",
    "authors": "Rainer Stotzka, Xin Chen, Maggie Hellström, Robert Quick",
    "abstract": "I'm unable to locate an abstract for the document associated with DOI 10.5445/IR/1000164658. The document, titled \"IG FAIR Digital Object Fabric,\" was authored by Rainer Stotzka, Xin Chen, Margarete Hellström, and Robert Quick, and was presented at the 20th RDA Plenary Meeting in Göteborg, Sweden, from March 21 to March 23, 2023. It is affiliated with the Scientific Computing Center (SCC) at the Karlsruhe Institute of Technology (KIT). The full text is available for download through the KITopen repository."
  },
  {
    "title": "A Controlled Vocabulary for Acronyms of NFDI-MatWerk Using the Vocabulary Service EVOKS",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000160373 ",
    "measure": "S-4",
    "authors": "Gulzaure Abdildina, Felix Ernst, Rossella Aversa, Philipp Ost",
    "abstract": "Controlled vocabularies are comprehensive collections of domain-specific terms used to describe knowledge within a specific field. They help overcome data ambiguity and offer benefits such as referencing term definitions, promoting semantic interoperability, and facilitating the integration of ontologies. EVOKS is a general-purpose vocabulary service that enables data stewards and scientists to easily create, edit, curate, and publish controlled vocabularies using the W3C recommended SKOS data model. The service ensures access to published vocabularies through the implementation of SKOSMOS, a dedicated vocabulary browser instance. NFDI-MatWerk provides a publicly accessible SKOSMOS instance for publishing vocabularies and an EVOKS instance for editing vocabularies exclusively for its members. The poster showcases the MatWerk Acronyms Vocabulary as an example and highlights the key features and benefits of using EVOKS, including collaborative work, the application of persistent URLs to vocabulary terms, and the integration of controlled vocabularies into metadata schemas."
  },
  {
    "title": "FAIR Digital Objects for the Realization of Globally Aligned Data Spaces",
    "year": 2024,
    "link": "https://doi.org/10.1109/BigData62323.2024.10825796",
    "measure": "S-4",
    "authors": "Nicolas Blumenroehr, Philipp Ost, Felix Kraus, Achim Streit",
    "abstract": "I'm unable to locate the abstract for the paper associated with DOI 10.1109/BigData62323.2024.10825796. The DOI corresponds to a paper presented at the 2024 IEEE International Conference on Big Data. However, the abstract does not appear to be publicly available at this time."
  },
  {
    "title": "NFDI4Ing Terminology Service",
    "year": 2021,
    "link": "https://terminology.nfdi4ing.de/ts4ing/index",
    "measure": "S-3-2",
    "authors": "Felix Engel, Giray Tuncay, Angelina Kraft",
    "abstract": "I couldn't find an abstract for the specific page you provided. However, the NFDI4Ing Terminology Service is a web-based application designed to facilitate comprehensive data and knowledge management tasks in engineering research. It enables researchers to create individual and reusable metadata profiles from standardized metadata blocks, which are based on formal terminologies. The service supports both human users and machine-to-machine communication, offering features like faceted full-text search, browsing of available terminologies, and a REST interface for machine retrieval. By providing clear connections between terminologies from different communities, it aims to enhance interoperability and reuse in a FAIR data context. ([nfdi4ing.de](https://nfdi4ing.de/5-3/?utm_source=openai))"
  },
  {
    "title": "TermClick",
    "year": 2022,
    "link": "https://addons.mozilla.org/en-GB/firefox/addon/termclick/",
    "measure": "S-3-2",
    "authors": "Giray Tuncay, Felix Engel",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Semantification of Space Data - A Feasibility Study",
    "year": 2023,
    "link": "not published",
    "measure": "S-3-2",
    "authors": "Felix Engel, Nenad Krdzavac, Erhun Giray Tuncay, Axel Klinger, John Hughes",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Software, Annotation Service",
    "year": 2023,
    "link": "https://terminology.nfdi4ing.de/ts/sandbox/annotation ",
    "measure": "S-3 ",
    "authors": "Engel, F., Chavada N., Tuncay, E.G. ",
    "abstract": "The NFDI4Ing Terminology Service (TS) is a repository for engineering ontologies, providing a single point of access to the latest ontology versions. It offers access to over 50 ontologies, 147,000 terms, and more than 5,800 properties from various engineering-related terminology collections. The service can be accessed via its web application or through a REST API, facilitating the integration of semantic concepts into research data management systems. ([tib-op.org](https://www.tib-op.org/ojs/index.php/CoRDI/article/view/207?utm_source=openai))\n\nThe \"sandbox\" environment within the NFDI4Ing TS is designed for testing and experimentation with terminologies and annotations. It allows users to explore and interact with the service's features without affecting the main repository. This environment is particularly useful for developers and researchers who wish to familiarize themselves with the functionalities of the TS before applying them to their projects.\n\nTo access the sandbox environment, visit the following URL:\n\nPlease note that JavaScript must be enabled in your browser to use the application."
  },
  {
    "title": "Service: Metadata Profile Service",
    "year": 2023,
    "link": "https://profiles.nfdi4ing.de",
    "measure": "S-3 ",
    "authors": NaN,
    "abstract": "Error: list index out of range"
  },
  {
    "title": "MetaStore",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.7685007 ",
    "measure": "S-3",
    "authors": "Volker Hartmann, Thomas Jejkal, Sabrine Chelbi",
    "abstract": "MetaStore is a research data repository software for storing metadata documents and schemas. Quality and consistency are ensured by associating and validating each document against a schema. It supports JSON and XML."
  },
  {
    "title": "Modelling Scientific Processes With the m4i Ontology",
    "year": 2023,
    "link": "https://doi.org/10.52825/cordi.v1i.271",
    "measure": "S-3",
    "authors": "Dorothea Iglezakis, Džulia Terzijska , Susanne Arndt, Sophia Leimer, Johanna Hickmann, Marc Fuhrmans, Giacomo Lanza",
    "abstract": "We present an approach to document research data in a human and machine readable way by creating JSON-LD metadata files based on the m4i ontology. m4i is based on top level ontologies and reuses concepts of widely accepted ontologies to embed information modelled in m4i in larger contexts like a knowledge graph connecting research data with projects, actors, methods, tools and publications. We use a real-life research example from the engineering domain to show how to describe a research process with its object of research, the different steps with input and output data, the actors, and the used methods and tools. The resulting metadata files can serve as low-threshold documentation in a file system, as an exchange format between tools, as an input for data repositories and as a source of information to be used by scripts and tools."
  },
  {
    "title": "MetadataHub",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.10351596",
    "measure": "S-3",
    "authors": "Volker Hartmann, Benedikt Heinrichs",
    "abstract": "The DOI 10.5281/zenodo.10351596 corresponds to the software \"MetadataHub,\" created by Volker Hartmann and Benedikt Heinrichs. The description provided is:\n\n\"Service for interacting with different kinds of metadata repositories implementing the turntable API or at least (for those frameworks not directly providing turntable API) a mapping for it.\"\n\nNo additional abstract is available."
  },
  {
    "title": "Semantification of Space Data-A Feasibility Study",
    "year": 2023,
    "link": "10.1109/JCDL57899.2023.00065",
    "measure": "S-3",
    "authors": "Engel, F., Krdzavac, N., Tuncay, E. G., Klinger, A., & Hughes, J. ",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Mit AIMS zu einem Metadatenmanagement 4.0: FAIRe Forschungsdaten benötigen interoperable Metadaten",
    "year": 2022,
    "link": "10.11588/HEIBOOKS.979.C13721",
    "measure": "S-3",
    "authors": "Grönewald, Matthias and Mund, Patrick and Bodenbrenner, Matthias and Fuhrmans, Marc and Heinrichs, Benedikt and Müller, Matthias S. and Pelz, Peter F. and Politze, Marius and Preuß, Nils and Schmitt, Robert H. and Stäcker, Thomas",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "MetaStore",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.7685007 ",
    "measure": "S-3",
    "authors": "Volker Hartmann, Thomas Jejkal, Sabrine Chelbi",
    "abstract": "MetaStore is a research data repository software for storing metadata documents and schemas. Quality and consistency are ensured by associating and validating each document against a schema. It supports JSON and XML."
  },
  {
    "title": "MetaStore",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.7685007 ",
    "measure": "S-3",
    "authors": "Volker Hartmann, Thomas Jejkal, Sabrine Chelbi",
    "abstract": "MetaStore is a research data repository software for storing metadata documents and schemas. Quality and consistency are ensured by associating and validating each document against a schema. It supports JSON and XML."
  },
  {
    "title": "MetaStore",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.7685007 ",
    "measure": "S-3",
    "authors": "Volker Hartmann, Thomas Jejkal, Sabrine Chelbi",
    "abstract": "MetaStore is a research data repository software for storing metadata documents and schemas. Quality and consistency are ensured by associating and validating each document against a schema. It supports JSON and XML."
  },
  {
    "title": "MetaStore",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.7685007 ",
    "measure": "S-3",
    "authors": "Volker Hartmann, Thomas Jejkal, Sabrine Chelbi",
    "abstract": "MetaStore is a research data repository software for storing metadata documents and schemas. Quality and consistency are ensured by associating and validating each document against a schema. It supports JSON and XML."
  },
  {
    "title": "Service: Knowledge Base for Research Software Development",
    "year": 2021,
    "link": "knowledge-base.nfdi4ing.de",
    "measure": "S-2",
    "authors": "Moritz Schwarzmeier, Tomislav Marić, Jan-Patrick Lehr, Ioannis Papagiannidis, Jessika Gappisch et al.",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Workshop: Einstieg ins Forschungsdatenmanagement mit git und GitLab",
    "year": 2022,
    "link": "https://nfdi4ing.pages.rwth-aachen.de/education/gitlab-workshop/preparation/",
    "measure": "S-2",
    "authors": "Marius Politze",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Service: Jupyterhub",
    "year": 2022,
    "link": "https://jupyter.nfdi4ing.de",
    "measure": "S-2",
    "authors": "Anett Seeland",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Service: NFDI4Ing GitLab for collaboration",
    "year": 2021,
    "link": "https://git.rwth-aachen.de/nfdi4ing",
    "measure": "S-2",
    "authors": "Marius Politze",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Continuous Integration of Scientific Software (in Computational Science and Engineering) (Presentation)",
    "year": 2022,
    "link": "https://zenodo.org/record/7153143",
    "measure": "S-2",
    "authors": "Moritz Schwarzmeier, Tomislav Maric, Tobias Tolle, Dennis Gläser, Jan-Patrick Lehr, Ioannis Papagiannidis, Benjamin Lambie, Dieter Bothe, Christian Bischof",
    "abstract": "The Zenodo record at https://zenodo.org/record/7153143 is titled \"Continuous\" Integration of Scientific Software (in Computational Science and Engineering). It is a presentation that describes the use of Continuous Integration for scientific (research) software in Computational Science and Engineering. The presentation links to the Knowledge Base (https://knowledge-base.nfdi4ing.de/) wherein this workflow is presented."
  },
  {
    "title": "twoPhaseInterTrackFoam: an OpenFOAM module for Arbitrary Lagrangian/Eulerian Interface Tracking with Surfactants and Subgrid-Scale Modeling",
    "year": 2024,
    "link": "10.48550/ARXIV.2403.19523",
    "measure": "S-2",
    "authors": "Schwarzmeier, M., Raju, S., Tuković, Ž., Fricke, M., Bothe, D., & Marić, T.",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "The SFB1194 approach to CI with OpenFOAM or How to make research software FAIR",
    "year": 2024,
    "link": "https://zenodo.org/doi/10.5281/zenodo.10285141",
    "measure": "S-2",
    "authors": "Moritz Schwarzmeier",
    "abstract": "The Zenodo record with DOI 10.5281/zenodo.10285141 is titled \"OpenFOAM RSE-SIG: The SFB1194 approach to CI with OpenFOAM or How to make research software FAIR.\" It is a presentation by Moritz Schwarzmeier from the Technical University of Darmstadt, delivered at the OpenFOAM Research-Software-Engineering Special Interest Group meeting on December 7, 2023. The presentation focuses on continuous integration (CI) for extensions of the OpenFOAM framework by engineers. The record is publicly accessible, but the files are restricted to users with access."
  },
  {
    "title": "Applied CI: an academic OpenFOAM example: Engineering Research Software ",
    "year": 2024,
    "link": "https://zenodo.org/doi/10.5281/zenodo.10704898",
    "measure": "S-2",
    "authors": "Moritz Schwarzmeier, Tomislav Maric, Dieter Bothe",
    "abstract": "The Zenodo record with DOI 10.5281/zenodo.10704898 is titled \"Applied CI: an academic OpenFOAM example.\" It is a presentation from the NFDI4Ing Community Meeting \"Engineering Research Software - The NFDI4Ing Community meets Archetype BETTY,\" which took place online on February 27, 2024. The authors are Moritz Schwarzmeier, Dieter Bothe, and Tomislav Marić from the Mathematical Modeling and Analysis (MMA) group at TU Darmstadt. The presentation discusses the application of continuous integration (CI) in academic settings, specifically using OpenFOAM, an open-source computational fluid dynamics software. The authors acknowledge support from the Federal Government and the Heads of Government of the Länder, as well as the Joint Science Conference (GWK), within the framework of the NFDI4Ing consortium (German Research Foundation (DFG) - project number 442146713)."
  },
  {
    "title": "On the automation of formatting OpenFOAM",
    "year": 2024,
    "link": "https://zenodo.org/doi/10.5281/zenodo.10965991",
    "measure": "S-2",
    "authors": "Moritz Schwarzmeier",
    "abstract": "I'm unable to locate an abstract for the document associated with DOI 10.5281/zenodo.10965991."
  },
  {
    "title": "twoPhaseInterTrackFoam: an OpenFOAM module for Arbitrary Lagrangian/Eulerian Interface Tracking with Surfactants and Subgrid-Scale Modeling",
    "year": 2024,
    "link": "https://doi.org/10.1016/j.cpc.2024.109460",
    "measure": "S-2",
    "authors": "Schwarzmeier, M., Raju, S., Tuković, Ž., Fricke, M., Bothe, D., & Marić, T.",
    "abstract": "I'm unable to locate the abstract for the article associated with DOI 10.1016/j.cpc.2024.109460."
  },
  {
    "title": "twoPhaseInterTrackFoam: an OpenFOAM module for Arbitrary Lagrangian/Eulerian Interface Tracking with Surfactants and Subgrid-Scale Modeling",
    "year": 2024,
    "link": "https://zenodo.org/doi/10.5281/zenodo.12525999",
    "measure": "S-2",
    "authors": "Schwarzmeier, M., Raju, S., Tuković, Ž., Fricke, M., Bothe, D., & Marić, T.",
    "abstract": "The abstract for the presentation titled \"twoPhaseInterTrackFoam: an OpenFOAM module for Arbitrary Lagrangian/Eulerian Interface Tracking with Surfactants and Subgrid-Scale Modeling\" is as follows:\n\n\"We present an implementation of the unstructured Finite-Volume Arbitrary Lagrangian / Eulerian (ALE) Interface-Tracking method for simulating incompressible, immiscible two-phase flows as an OpenFOAM module [1][2]. In addition to interface-tracking capabilities that include tracking of two fluid phases, an implementation of a Subgrid-Scale (SGS) modeling framework for increased accuracy when simulating sharp boundary layers is enclosed. The SGS modeling framework simplifies embedding subgrid-scale profiles into the unstructured Finite Volume discretization. Our design of the SGS model library significantly simplifies adding new SGS models and applying SGS modeling to Partial Differential Equations (PDEs) in OpenFOAM. In the training we show-case how to take advantage from the SGS in your solver and what features the SGS has. We will set up a parameter study with the SGS. The parameter study will be automatically evaluated and show how to make it part of a Continuous Integration (CI) pipeline. The workflow presented at last’ years OFW will be employed [3].\"\n\nThe presentation is available at:\n\nhttps://zenodo.org/doi/10.5281/zenodo.12525999"
  },
  {
    "title": "Service: RDMO - NFDI4Ing",
    "year": 2022,
    "link": "https://rdmo.nfdi4ing.de/",
    "measure": "S-1-2,1-3",
    "authors": "Jürgen Windeck, David Wallace, Daniela Hausen, Sabine Schönau",
    "abstract": "The NFDI4Ing RDMO service is a tool designed to assist researchers in the engineering sciences with planning, implementing, and organizing research data management (RDM). It enables the creation of dynamic and adaptable data management plans (DMPs) tailored to specific research projects. The service offers a step-by-step guide based on the DFG checklist \"Handling of Research Data,\" enriched with guidance and examples pertinent to engineering research. This initiative aims to support researchers in meeting funding agencies' requirements and promoting FAIR (Findable, Accessible, Interoperable, Reusable) data management practices. ([nfdi4ing.de](https://nfdi4ing.de/nfdi4ing-rdmo/?utm_source=openai))"
  },
  {
    "title": "Data management planning: Concept for Setting up a Working Group in the NFDI Section Common Infrastructures",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.6499327",
    "measure": "S-1-2,1-3",
    "authors": "Harry Enke, Daniela Hausen, Christin Henzen, Gerald Jagusch, Celia Krause, Sabine Schönau, Jürgen Windeck",
    "abstract": "The document titled \"Data management planning: Concept for Setting up a Working Group in the NFDI Section Common Infrastructures\" does not provide an abstract. However, the description states that the report discusses the importance of data management planning (DMP) in scientific collaborations, highlighting the role of DMP tools like RDMO in managing information efficiently. It also emphasizes the need to consider both technical and content aspects of DMP, including templates and disciplinary guidelines, and promotes coordination processes between consortia to develop sustainable operating models."
  },
  {
    "title": "Service: Reifegradmodelle in der NFDI4Ing - Checklisten",
    "year": 2022,
    "link": "https://git.rwth-aachen.de/nfdi4ing/s-1/fdm-reifegradmodelle ",
    "measure": "S-1-1 ",
    "authors": "Max Leo Wawer",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Reifegradmodell für das Management des Datenzugriffs",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.7730557",
    "measure": "S-1-1 ",
    "authors": "Max Leo Wawer",
    "abstract": "The document titled \"Reifegradmodell für das Management des Datenzugriffs\" (Maturity Model for Data Access Management) presents a maturity model developed by NFDI4Ing Base Service S-1 for managing data access in research projects. Additionally, a checklist for self-assessment of the maturity level has been prepared."
  },
  {
    "title": "Quality Assessment for Research Data Management in Research Projects",
    "year": 2023,
    "link": "10.52825/cordi.v1i.420",
    "measure": "S-1-1 ",
    "authors": "Max Leo Wawer, Johanna Wurst, Roland Lachmayer",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Data quality assurance in the research process using the example of tensile tests",
    "year": 2023,
    "link": "https://www.designsociety.org/publication/46856/Data+quality+assurance+in+the+research+process+using+the+example+of+tensile+tests",
    "measure": "S-1-1, SIG QA",
    "authors": "Müller, Laura; Wawer, Max Leo; Heimes, Norman; Uhe, Johanna; Koepler, Oliver; Auer, Sören; Lachmayer, Roland; Mozgova, Mozgova",
    "abstract": "Progressive digitization throughout the entire product data life cycle requires a more sensitive handling and understanding of data within engineering processes. Regarding engineering research data, the aim is to implement the FAIR data principles (Findable, Accessible, Interoperable, Reusable) to guarantee the post-usability of research data."
  },
  {
    "title": "Quality Assessment for Research Data Management in Research Projects -Poster CoRDI",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.8347690",
    "measure": "S-1-1",
    "authors": "Max Leo Wawer, Johanna Wurst, & Roland Lachmayer",
    "abstract": "The document titled \"Quality Assessment for Research Data Management in Research Projects\" presents maturity models to assess research data management (RDM) in engineering research projects. Individual maturity models are developed for identified process areas that include RDM activities based on their occurrence in the research process. These models enable a qualitative assessment on discrete maturity levels, from an initial state to an optimizing final state. Researchers are primarily responsible for meeting the requirements of research data management, which is why the maturity models are aimed directly at the researchers in the research project and enable self-assessment. The individual maturity models follow a defined maturity structure with five maturity levels from an undefined, reactive stage to continuous improvement and active participation in the research community. This work thus shows the structural framework of the maturity models to be developed and offers an implementation of research data management in the research process."
  },
  {
    "title": "FDM4Ing Community Meeting CC-42: Introduction in RDM and using RDMO for your engineering projects",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.10262633",
    "measure": "S-1/CC42",
    "authors": "Hastik, C., Windeck, J., & Schönau, S.",
    "abstract": "The NFDI4Ing Community Cluster CC-42 Meeting delved into research data management (RDM) and the application of RDMO in engineering projects. With key speakers Jürgen Windeck, Sabine Schönau, and Canan Hastik the online workshop attracted 30 diverse participants. The session emphasized the significance of data management plans (DMPs) using the NFDI4Ing RDMO tool. Three engineering projects from the Technical University of Darmstadt were presented, serving as case studies for RDMO applicability. The workshop highlighted varied needs within CC-42, revealing a call for improved RDMO support, clearer templates, and industry-specific considerations. The event laid groundwork for harmonization and standardization in application-related processes within the community."
  },
  {
    "title": "IG Research Data Management in Engineering - Data Quality and FAIR metrics in Engineering",
    "year": 2021,
    "link": "https://www.rd-alliance.org/plenaries/rda-18th-plenary-meeting-virtual/ig-research-data-management-engineering-data-quality-and",
    "measure": "S-1 ",
    "authors": "Iryna Mozgova, Jens Freund, Daniela Hausen, Mario Moser",
    "abstract": "I'm unable to locate the specific abstract for the \"IG Research Data Management Engineering Data Quality\" session from the RDA 18th Plenary Meeting. However, I can provide some context about the Research Data Management in Engineering Interest Group (IG RDM4Eng) and its activities.\n\nThe IG RDM4Eng focuses on improving data management practices within various engineering sub-disciplines, such as chemical, civil, electrical, and mechanical engineering. Engineering research is often multidisciplinary and closely collaborates with industry, leading to unaligned data management practices with open data initiatives and the FAIR data principles. The group's aims include changing the culture of data handling, creating awareness, bridging sub-communities, and providing a platform for developing consensus on RDM best practices in engineering. They work with use cases to provide best practices and examples from different subcommunities. ([rd-alliance.org](https://www.rd-alliance.org/groups/research-data-management-engineering-ig/activity/?utm_source=openai))\n\nAt the 18th RDA Plenary Meeting, the IG RDM4Eng organized a session titled \"Metadata for Data Indexing and Data Discovery in Materials Science and Engineering.\" The meeting objectives were to define and discuss the opportunities of Linked Data, Semantic Web, and related technologies within materials science and engineering, survey the current landscape, discuss opportunities for collaboration, and identify potential action steps for further progress. The successful development and adoption of these technologies aim to improve the findability of data and other resources within the materials community. ([bioschemas.org](https://bioschemas.org/meetings/2021-11_RDA18?utm_source=openai))\n\nWhile this information provides an overview of the group's focus and activities, the specific abstract for the \"IG Research Data Management Engineering Data Quality\" session is not available in the provided sources."
  },
  {
    "title": "Product Life Cycle Oriented Data Management Planning with RDMO at the Example of Research Field Data",
    "year": 2022,
    "link": "https://doi.org/10.11588/heibooks.979.c13722",
    "measure": "S-1 ",
    "authors": "Iryna Mozgova, Gerald Jagusch, Jens Freund et al.",
    "abstract": "I have located the abstract for the document associated with DOI 10.11588/heibooks.979.c13722. Here is the abstract:\n\n\"A research data management plan (DMP) is an integral part of the organization of working with research data according to the FAIR-Data-Principles. The task area Base Services of the National Research Data Infrastructure for Engineering Sciences (NFDI4Ing) support the open source software Research Data Management Organiser (RDMO) as an important and well established tool for data management planning. The purpose of this contribution is to demonstrate the application of RDMO for the organization of field data throughout a product life cycle at the example of the pilot use case of the archetype Golo. The possibilities of creating DMPs for the outlined use case using RDMO are presented.\""
  },
  {
    "title": "Research Data Management Workflow – A Framework for Engineering Science",
    "year": 2024,
    "link": "http://dx.doi.org/10.35199/NORDDESIGN2024.79",
    "measure": "S-1 ",
    "authors": "Max Leo Wawer, Johanna Wurst, & Roland Lachmayer",
    "abstract": "Many research results in engineering science are based on the further processing of digital objects, which increases the need for reusable data. In this context, researchers are becoming increasingly familiar with implementing comprehensive data management as part of their research. Using the example of an engineering research result a generic research data management workflow was developed to ensure the traceability and reusability of research results and associated digital objects. This workflow represents a research process-orientated research data management driven by the data provenance."
  },
  {
    "title": " Five Minutes to Write a Software Management Plan – A Machine-actionable Approach to Simplify the Creation of SMPs. ",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.10374839",
    "measure": "S-1",
    "authors": "Castro, L. J., Geist, L., Gonzalez, E., Gonzalez-Ocanto, M., Grossmann, Y. V., Pronk, T., Solanki, D., Utrilla Guerrero, C., Wallace, D., & Windeck, J.",
    "abstract": "The abstract for the document titled \"Five Minutes to Write a Software Management Plan – A Machine-actionable Approach to Simplify the Creation of SMPs\" is as follows:\n\n\"The Software Management Plan (SMP) is a relevant tool for handling research software. Despite benefits for research (e.g., low barrier for researchers, promotion of good practices), SMPs are not yet used across the board. A semi-automated approach can solve this problem. In the following document, we discuss a possible workflow for creating machine-actionable SMPs using various tools. This approach was developed during an NFDI4DataScience hackathon at the German National Library of Medicine (ZB Med) - Information Centre of Life Sciences on maSMPs at the end of 2023.\""
  },
  {
    "title": "Reifegradmodell für die Verwaltung des Datenzugriffs",
    "year": 2023,
    "link": "https://doi.org/10.11588/heibooks.1288.c18082",
    "measure": "S-1",
    "authors": "Wawer M. L., Lachmayer R.",
    "abstract": "I couldn't find an abstract for the document associated with DOI 10.11588/heibooks.1288.c18082."
  },
  {
    "title": "A Vision for Data Management Plans in the NFDI",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.10570654",
    "measure": "S-1",
    "authors": "Diederichs, Katja., Krause, Celia, Lemaire, Marina, Reidelbach, Marco, & Windeck, Jürgen ",
    "abstract": "At present, data management plans (DMPs) are still often perceived as mere documents for funding agencies providing clarity on how research data will be handled during a funded project, but are not usually actively involved in the processes. However, they contain a great deal of information that can be shared automatically to facilitate active research data management (RDM) by providing metadata to research infrastructures and supporting communication between all involved stakeholders. This position paper brings together a number of ideas developed and collected during interdisciplinary workshops of the Data Management Planning Working Group (infra-dmp), which is part of the section Common Infrastructures of the National Research Data Infrastructure (NFDI) in Germany. We present our vision of a possible future role of DMPs, templates, and tools in the upcoming NFDI service architecture."
  },
  {
    "title": "NFDI4Ing DMP Template (Version 2)",
    "year": 2024,
    "link": "https://github.com/rdmorganiser/rdmo-catalog/tree/master-rdmo2.x/shared/nfdi4ing",
    "measure": "S-1",
    "authors": "Jürgen Windeck, Sabine Schönau",
    "abstract": "The GitHub repository at https://github.com/rdmorganiser/rdmo-catalog/tree/master-rdmo2.x/shared/nfdi4ing contains the NFDI4Ing Data Management Plan (DMP) Template. This template is based on the DFG checklist and includes engineering-specific information. It is compatible with RDMO version 2.1.0 and later. The repository provides the full XML export required for import into RDMO. The catalog utilizes the `{more}`-tag to hide and show parts of the text, a feature available since RDMO release 2.1.0."
  },
  {
    "title": "Quality Criteria for DMP Templates",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.13347687",
    "measure": "S-1",
    "authors": "Celia Krause, Katharina Bergmann, Daniela Hausen, Roman Riedel, & Jürgen Windeck",
    "abstract": "The document titled \"Quality Criteria for DMP Templates\" is a report published on August 20, 2024, by the National Research Data Infrastructure (NFDI). It addresses the need for standardized quality criteria in the development and selection of Data Management Plan (DMP) templates, which are essential for planning data management in research. The report outlines both content and formal criteria, categorizing them into five levels to illustrate the effort required for implementation. These criteria aim to guide research data management professionals and data stewards, promoting consistency and comparability of DMPs at the national level. The report is available in both English and German."
  },
  {
    "title": "Connecting RDM Services. Interoperability and Interfaces for RDMO ",
    "year": 2024,
    "link": "https://doi.org/10.17192/bfdm.2024.2.8629",
    "measure": "S-1",
    "authors": "Windeck, J., Schröder, M., Frenzel, J., Kusmierz, S., Fuchs, H., & Klar, J.",
    "abstract": "The Research Data Management Organiser (RDMO) supports researchers in the creation of data management plans (DMPs). The open source software has established itself widely across Germany as the standard DMP tool. For its broader adoption, integration with other services for research data management is key. In this paper we reflect on the potential of RDMO on this issue, we explain its adaptiveness by design, its plugin architecture, and report on the first RDMO Hackathon organized in Darmstadt in Aug 2023 which focussed on the integration of RDMO via plugins. We present three extensions and plugins developed during the hackathon: 1.) a JSON-editor for RDMO data transfer and mapping, 2.) an RO-crate export plugin, 3.) a sensor database option set plugin."
  },
  {
    "title": "Data Quality Metrics",
    "year": 2022,
    "link": "https://data-quality-metrics.readthedocs.io/en/main/",
    "measure": "GOLO",
    "authors": "Hauke Dierend",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Management of Research Field Data within the Concept of Digital Twin",
    "year": 2022,
    "link": "https://doi.org/10.1007/978-3-031-16281-7_20 ",
    "measure": "GOLO",
    "authors": "Hauke Dierend, Osman Altun, Iryna Mozgova, Roland Lachmayer",
    "abstract": "I found the abstract for the article titled \"Digitization and its Discontents: The Promise and Limitations of Digital Mental Health Interventions\":\n\n\"There is a mental health crisis in the United States that shows no signs of abating. Prevalence rates of mental disorders among both adults and children are rising and there are simply not enough mental health professionals to meet the growing demand. To address this problem, digital programs are being designed to diagnose and treat mental health conditions either adjunctively to a human clinician or as stand-alone treatments. Such developments hold great promise in ameliorating the mental health professional supply shortage. However, certain limitations of digital programs may prevent many users from desiring a digital psychotherapist. This paper surveys both the promise, and limitations, of digital psychotherapies.\" ([springermedicine.com](https://www.springermedicine.com/psychotherapy/psychotherapy/digitization-and-its-discontents-the-promise-and-limitations-of-/26960302?utm_source=openai))"
  },
  {
    "title": "Publikation: Product Life Cycle Oriented Data Management Planning with RDMO at the Example of Research Field Data",
    "year": 2021,
    "link": "http://dx.doi.org/10.11588/heibooks.979.c13722 ",
    "measure": "GOLO",
    "authors": "Iryna Mozgova, Gerald Jagusch, Jens Freund, Angelina Kraft, Tobias Glück, Kevin Herrmann, Marvin Knöchelmann, Roland Lachmayer ",
    "abstract": "I have located the abstract for the document associated with DOI 10.11588/heibooks.979.c13722. Here is the abstract:\n\n\"A research data management plan (DMP) is an integral part of the organization of working with research data according to the FAIR-Data-Principles. The task area Base Services of the National Research Data Infrastructure for Engineering Sciences (NFDI4Ing) support the open source software Research Data Management Organiser (RDMO) as an important and well established tool for data management planning. The purpose of this contribution is to demonstrate the application of RDMO for the organization of field data throughout a product life cycle at the example of the pilot use case of the archetype Golo. The possibilities of creating DMPs for the outlined use case using RDMO are presented.\""
  },
  {
    "title": "Publikation: Distraction Potential of Vehicle-Based On-Road Projection",
    "year": 2021,
    "link": "https://doi.org/10.3390/app112412030",
    "measure": "GOLO",
    "authors": "Tobias Glück, Tobias Biermann, Alexander Wolf, Sören Budig, Arved Ziebehl, Marvin Knöchelmann and Roland Lachmayer",
    "abstract": "I couldn't find an abstract for the DOI 10.3390/app112412030."
  },
  {
    "title": "GitHub repository: \"CAN Steering Angle Reader - VW Passat\"",
    "year": 2023,
    "link": "https://github.com/RayenHML/CAN-Steering-Angle-Reader-VW-Passat ",
    "measure": "GOLO",
    "authors": "Rayen Hamlaoui",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Vortrag auf der NFDI4Ing-Konferenz 2023 (Gooran Orimi et al., 2023. “A Digital Twin Framework for Field Data and Distributed Systems”)",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.8403959",
    "measure": "GOLO",
    "authors": "A. Gooran Orimi, R. Hamlaoui, C. Backe, V. Briken, et al.",
    "abstract": "Despite the considerable benefits of Digital Twins (DTs) in industry and engineering, existing DTs are primarily domain-dependent and cannot be directly generalized to more complex scenarios. This is particularly evident when the physical system corresponds to a field-dependent entity within distributed systems, which hinders a straightforward implementation of DTs by researchers. In this presentation, we discuss the fundamental concepts of a DT framework and ask how DTs can be employed for distributed systems and field-related entities. We introduce a generalized DT framework designed to encompass distributed systems across both physical and virtual spaces, with a particular emphasis on facilitating communication between these domains. Subsequently, we define the necessary components and elaborate on their specific characteristics. The functionality of these DT components in the context of digital master and digital shadows are further investigated. Furthermore, we explore a case study implemented in the GOLO archetype of the NFDI4Ing consortium. This case study involves three distinct physical entities: a vehicle equipped with the necessary tools and sensors, the public road and traffic environment, and the driver. We investigate each of these entities and show how the examined DT framework can be effectively applied."
  },
  {
    "title": "Vortrag auf der NFDI4Ing-Konferenz 2023 (Backe et al., 2023. “Workflow elements for the creation of rich metadata in collaborative research environments”)",
    "year": 2023,
    "link": "https://zenodo.org/records/8430753",
    "measure": "GOLO",
    "authors": "C. Backe, A. Gooran Orimi, V. Briken, et al.",
    "abstract": "The abstract for the presentation titled \"Creating Rich Metadata for Collaborative Research: Case Studies and Challenges\" is as follows:\n\nThis presentation, which was held at the NFDI4Ing Conference 2023, showcases workflow elements for the creation of rich metadata in collaborative research. These elements are part of a larger framework that is under active development and aims to provide practical guidance to researchers, data managers, and the research data management (RDM) community, on effectively managing metadata along the data lifecycle. The framework is motivated and validated by two applied projects: DeeperSense and RoBivaL, which have been conducted by the DFKI Robotics Innovation Center in coordination with the NFDI4Ing Task Area Golo.\n\nThe first part of the presentation focuses on these two case studies. Due to their different research goals and methods, the two projects have different data and metadata profiles, making them suitable test cases for a framework that shall be general enough to support a broad range of applications. The presentation addresses selected data management tasks in different data lifecycle phases. It argues that data managers who strive to produce FAIR metadata are intermediaries between their research team and potential data reusers, two groups with very different requirements and practices. It further makes the case that the consumer-facing part of FAIR metadata is very small compared to the invisible \"precursor\" metadata which needs to be generated and managed in order to reach a certain quality level.\n\nThe second part of the presentation proposes a set of workflow-oriented metadata categories that emerged from data management practice. These categories are orthogonal to established categories that focus on purpose or semantics, such as structural, descriptive, or administrative metadata.\n\nThe proposed categories are organized along three dimensions:\n\nFirstly, a workflow-oriented view on metadata must recognize that every data instance is the output of some procedure. Both procedure and output are sources of metadata. High-level examples of procedures are the stages of the data lifecycle, i.e. planning, collection, analysis, etc. Each stage comprises additional mid- and low-level procedures which create intermediate outputs.\n\nThe relevance of analyzing procedures for metadata creation is well-established in the RDM community, evident e.g. by the \"processing step\" class, which is at the core of the Metadata4Ing (M4I) ontology. While the M4I ontology may be a suitable tool for communicating metadata to data consumers, this presentation argues that the production of (precursor) metadata in research teams requires additional tools.\n\nSecondly, before data is created or transformed, both the procedure and its output are usually planned and specified, resulting in metadata that is not extracted from the data but injected into it. Examples for injected metadata are the address of a software repository (specifying a procedure), or a database schema (specifying an output). Extracted metadata are e.g. performance metrics (of a procedure) or a file checksum (of an output).\n\nThirdly, metadata itself is also data, as noted by virtually every metadata definition. Consequently, yet rarely recognized, metadata creation is recursive. The presentation gives examples of higher-order metadata (\"meta-metadata\") on multiple levels of recursion. It then discusses the different purposes of higher-order metadata for research teams, data reusers, and the RDM community.\n\nThe presentation concludes with a question. Regarding the multitude of challenges and requirements, the different demands of research teams and data reusers, the amount of precursor metadata necessary for high-quality consumer metadata: How do we avoid \"scope explosion\"? How is (meta)data management different from general knowledge management? These questions shall be addressed in future research."
  },
  {
    "title": "Umfrage für Feldversuche von Feldingenieur*innen",
    "year": 2022,
    "link": "https://survey.uni-hannover.de/index.php/659451 ",
    "measure": "GOLO",
    "authors": "Hauke Dierend, Philipp Findling",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Publikation: \"Distraction Potential of Vehicle-Based On-Road Projection\" Applied Sciences 11, no. 24: 12030. ",
    "year": "2021.",
    "link": "https://doi.org/10.3390/app112412030 ",
    "measure": "GOLO",
    "authors": "T. Glück, T. Biermann, A. Wolf, S. Budig, A. Ziebehl,M.  Knöchelmann, R. Lachmayer",
    "abstract": "I'm unable to locate the abstract for the article associated with DOI 10.3390/app112412030."
  },
  {
    "title": "Publikation: \"Collaborative creation and management of rich FAIR metadata: Two case studies from robotics field research,\" ing.grid, forthcoming.",
    "year": "2024 -2025",
    "link": "Under review",
    "measure": "GOLO",
    "authors": "C. Backe, V. Briken, A. Gooran Orimi, et al.",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Digital Twin for Field Data Management: Design of a platform to promote FAIR principles and ensure data reusability_CIRP_2025",
    "year": "2024 -2025",
    "link": "Under review",
    "measure": "GOLO",
    "authors": "Rayen Hamlaouia, Atefeh Gooran Orimia, Reem Doniaa, Christian Backeb, Veit Brikenb, Roland Lachmayera",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Dataset: \"Sonar-to-RGB Image Translation for Diver Monitoring in Poor Visibility Environments,\" https://zenodo.org/records/7728089, Experiment Data, Mar. 2023. \n",
    "year": 2023,
    "link": "DOI: 10.5281/zenodo.7728089.",
    "measure": "GOLO",
    "authors": "B. Wehbe, N. Shah, M. Bande, et al., ",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Publikation: \"Comparative study of soil interaction and driving characteristics of different agricultural and space robots in an agricultural environment,\" Journal of Field Robotics, forthcoming, submitted on 09-Nov-2023.\n",
    "year": 2023,
    "link": "Submitted",
    "measure": "GOLO",
    "authors": "M. Wirkus, S. Hinck, C. Backe, et al., ",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Dataset: \"RoBivaL data corpus,\" https://zenodo.org/record/8424933, Experiment Data, Mar. 2024. DOI: 10.5281/zenodo.8424933.",
    "year": 2024,
    "link": "DOI: 10.5281/zenodo.8424933.",
    "measure": "GOLO",
    "authors": "C. Backe, M. Wirkus, S. Hinck, et al., ",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Dataset: \"Metadata of a Large Sonar and Stereo Camera Dataset Suitable for Sonar-to-RGB Image Translation,\" Experiment Data, Dec. 2023. DOI: 10.5281/zenodo.10373154.",
    "year": 2023,
    "link": "DOI: 10.5281/zenodo.10373154",
    "measure": "GOLO",
    "authors": "C. Backe, B. Wehbe, M. Bande, et al.",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "GOLO's field database platform",
    "year": 2024,
    "link": "https://fielddatabaseplatform.nfdi4ing.de/",
    "measure": "GOLO",
    "authors": "Rayen Hamlaoui",
    "abstract": "The Field Database Platform (FDP) is a management platform designed to offer exploration, previewing, and operational filtering of sensor field data. Unlike traditional data storage solutions, the FDP features a user-friendly web dashboard that allows researchers to visualize data through cards and graphs, conduct preliminary analyses, identify trends, and filter data based on specific research needs. The platform utilizes data generated by the digital shadows of technical systems, laying the groundwork for a digital twin in field data management. ([nfdi4ing.de](https://nfdi4ing.de/fielddatabaseplatform/?utm_source=openai))\n\nThe FDP is openly available for use by researchers who work with datasets from field sensors, and no registration is needed. ([nfdi4ing.de](https://nfdi4ing.de/fielddatabaseplatform/?utm_source=openai))\n\nFor more information or assistance, you can contact Rayen Hamlaoui at hamlaoui@ipeg.uni-hannover.de. ([nfdi4ing.de](https://nfdi4ing.de/fielddatabaseplatform/?utm_source=openai))"
  },
  {
    "title": "Conference paper_Licht 2025: \"Kamerabasierte dynamische Fahrbahnprojektion mit qualitativer Evaluation des Felddatenmanagements \"",
    "year": 2025,
    "link": "In progress",
    "measure": "GOLO",
    "authors": "Hamlaoui, Rayen; Wawer, Max Leo; Hosseini, Seyed Amirhossein; Gooran Orimi, Atefeh; Glück, Tobias; Wurst, Johanna; Prof. Dr.-Ing. Lachmayer, Roland,",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Review Paper: \"AI-Driven Methods for Field Data Analysis: A Comparative Review\"",
    "year": 2025,
    "link": "In progress",
    "measure": "GOLO",
    "authors": "A. Gooran Orimi, R. Hamlaoui, C. Backe, V. Briken, Y. Wang, H. Fallahi, R. Lachmayer",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Journal Paer_ZWF: \"Human-AI Teaming in a Digital Twin Model for Virtual Product Development\"",
    "year": "2024-2025",
    "link": "Under review",
    "measure": "GOLO",
    "authors": "A. Gooran Orimi, S. Saralajew, J. feng, Z. Dai, R. Hamlaoui, T. Stauß, R. Lachmayer",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Workflows ingenieurwissenschaftlicher Forschungsabläufe - Auszug des aktuellen Forschungsstands",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.7125571",
    "measure": "Frank",
    "authors": "Hamann, Tobias; Moser, Mario",
    "abstract": "The document titled \"Workflows ingenieurwissenschaftlicher Forschungsabläufe - Auszug des aktuellen Forschungsstands\" is a conference paper authored by Tobias Hamann and Mario Moser from the Laboratory for Machine Tools and Production Engineering (WZL) of RWTH Aachen University. It was published on September 29, 2022, and is available under the Creative Commons Attribution 4.0 International license. The paper presents a proposed new approach to the data life cycle by NFDI4Ing Task Area Frank, with a follow-up paper planned. The authors acknowledge funding and support from the German Research Foundation (DFG) under project number 442146713."
  },
  {
    "title": "Sektionskonzept Meta(daten), Terminologien und Provenienz zur Einrichtung einer Sektion im Verein Nationale Forschungsdateninfrastruktur (NFDI) e.V.",
    "year": 2021,
    "link": "https://doi.org/10.5281/zenodo.5619089",
    "measure": "Frank",
    "authors": "Koepler, Oliver, Schrade, Torsten, Neumann, Steffen, Stotzka, Rainer, Wiljes, Cord, Blümel, Ina, Bracht, Christian, Hamann, Tobias, Arndt, Susanne, & Hunold, Johannes",
    "abstract": "I found the following description for the document associated with DOI 10.5281/zenodo.5619089:\n\n\"Name der Sektion: Meta(daten), Terminologien, Provenienz\n\nAkronym der Sektion: section-metadata\n\nAnsprechpersonen Sektionseinrichtung: Prof. Dr. Torsten Schrade (NFDI4Culture), Dr. Oliver Koepler (NFDI4Chem)\n\nDie Sektion befasst sich mit den Themenbereichen (Meta)daten, Terminologien und Provenienz. Aufgabenfelder der Sektion umfassen organisatorische Aspekte (Kollaboration, Wissenstransfer), inhaltliche Aspekte (z.B. Modellierung/Ontologien) und infrastrukturelle Perspektiven (Entwicklung von Standards / Basisdiensten). Eine der wesentlichen Aufgaben der Sektion wird sein, die Arbeit der NFDI-Konsortien im Bereich (Meta)daten, Terminologien und Provenienz entlang der FAIR Kriterien wechselseitig sichtbar zu machen, zu harmonisieren und nachnutzbar zu machen. Hierbei wird die Sektion in enger Rückkopplung mit den Sektionen “Common Infrastructures” sowie “Ethical, Social and Legal Aspects” insbesondere die Themenbereiche Terminologien und Provenienz bearbeiten.\n\nIm Themenbereich Metadaten und Forschungsdaten - im Folgenden kurz (Meta)daten - beschäftigt sich die Sektion mit Fragen zur (Meta-)daten-Harmonisierung, Auffindbarkeit von Daten, allgemeine Daten- und Metadaten-Standards mit Blick auf ein mögliches NFDI-Kernmetadatenformat sowie Formatumwandlungen und Persistent-Identifier-Systemen.\n\nIm Themenbereich Terminologien beschäftigt sich die Sektion mit community- und disziplinenübergreifenden Definitionen von Top-Level Ontologien und Mappings von Ontologien sowie Best Practices zur Modellierung von Terminologien, Vokabularen und Ontologien sowie darauf aufbauenden Diensten zur Datenintegration (z.B. Terminology Service, Knowledge Graphs etc.).\n\nIm Themenbereich Provenienz befasst sich die Sektion mit rechtlichen, technischen und kulturellen Aspekten des Entstehungskontextes von (Meta)daten (z.B. im Rahmen von Experimenten, Laborbüchern, Digitalisierungsprozessen etc.) und entwirft Vorschläge für einheitliche und nachvollziehbare Dokumentationsverfahren zur Beantwortung der Fragen nach dem was, wo, wann, wer, wie und warum der Datenerzeugung und Datenprozessierung. Hierbei entwickelt die Sektion Empfehlungen für die Abbildung der Provenienz in einem möglichen NFDI-Kernmetadatenformat.\""
  },
  {
    "title": "Jarves: The digital RDM assistant",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.7715684",
    "measure": "Frank",
    "authors": "Hamann, Tobias",
    "abstract": "The document titled \"Jarves: The digital RDM assistant\" is a presentation by Tobias Hamann from RWTH Aachen University, delivered at the Research Data Alliance's 20th Plenary Meeting in Gothenburg. It introduces Jarves, the Joint Assistant for Research in Versatile Engineering Sciences, a digital research data management (RDM) assistant. The presentation is available under a CC-BY 4.0 license."
  },
  {
    "title": "Challenges in publishing research data – a Fraunhofer Case Study",
    "year": 2023,
    "link": "WIP",
    "measure": "Frank",
    "authors": "Robrecht, Michéle; Kehl, Pierre",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Implementing usability-improved data management plans in interdisciplinary engineering projects",
    "year": 2022,
    "link": "https://doi.org/10.5281/ZENODO.7362038",
    "measure": "Frank",
    "authors": "Kim, Soo-Yon; Hillemacher, Steffen",
    "abstract": "I couldn't find an abstract for the document associated with DOI 10.5281/ZENODO.7362038."
  },
  {
    "title": "Jarves CoRDI Poster EMBARGO: 12.09.2023",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.8315364",
    "measure": "Frank",
    "authors": "Tobias Hamann, Jonas Werheid",
    "abstract": "The DOI 10.5281/zenodo.8315364 corresponds to a conference poster titled \"Jarves: CoRDI 2023\" by Tobias Hamann and Jonas Werheid from the Werkzeugmaschinenlabor WZL der RWTH Aachen. The poster presents information about NFDI4Ing's digital data steward, Jarves. An abstract is not provided in the available information."
  },
  {
    "title": "Service (Weiterentwicklung): Open Research Knowledge Graph (ORKG)",
    "year": "2021, 2022",
    "link": "https://orkg.org/template/R166722, https://orkg.org/template/R178304, https://service.tib.eu/ts4tib/index",
    "measure": "Ellen, S-3",
    "authors": "-",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Example Usecase - Observatory: Energy System Analysis",
    "year": 2022,
    "link": "https://www.orkg.org/orkg/observatory/Energy_System_Research",
    "measure": "Ellen, S-3",
    "authors": "-",
    "abstract": "The Open Research Knowledge Graph (ORKG) provides an observatory on Energy System Research, serving as a central hub for curated publications, comparisons, and visualizations in this field. This observatory aims to enhance the organization and accessibility of scientific knowledge related to energy systems, facilitating better communication, understanding, and reuse among researchers. By leveraging ORKG templates and integrating ontologies like the Open Energy Ontology (OEO), the observatory ensures consistent and comparable descriptions of scientific knowledge across various publications. This initiative supports the FAIR (Findable, Accessible, Interoperable, and Reusable) principles in data management, promoting open science and collaboration within the energy system research community. ([arxiv.org](https://arxiv.org/html/2401.13365v1?utm_source=openai))"
  },
  {
    "title": "Preprint: A metadata-based approach to improve the findability and interoperability of research software",
    "year": 2022,
    "link": "https://arxiv.org/abs/2306.10620",
    "measure": "Ellen, S-3",
    "authors": "Patrick Kuckertz, Jan Göpfert, Oliver Karras, David Neuroth, Julian Schönau, Rodrigo Pueblas, Stephan Ferenz, Felix Engel, Noah Pflugradt, Jann M. Weinand, Leander Kotzur, Astrid Nieße, Sören Auer, Detlef Stolten",
    "abstract": "The reuse of research software is central to research efficiency and academic exchange. The application of software enables researchers with varied backgrounds to reproduce, validate, and expand upon study findings. Furthermore, the analysis of open source code aids in the comprehension, comparison, and integration of approaches. Often, however, no further use occurs because relevant software cannot be found or is incompatible with existing research processes. This results in repetitive software development, which impedes the advancement of individual researchers and entire research communities. In this article, the DataDesc ecosystem is presented, an approach to describing data models of software interfaces with detailed and machine-actionable metadata. In addition to a specialized metadata schema, an exchange format and support tools for easy collection and the automated publishing of software documentation are introduced. This approach practically increases the FAIRness, i.e., findability, accessibility, interoperability, and so the reusability of research software, as well as effectively promotes its impact on research."
  },
  {
    "title": "Webinar: USER STORIES aus der Energieforschung - Wie uns Ontologien bei der Entwicklung von Datenbanken helfen",
    "year": 2021,
    "link": "https://nfdi4ing.de/wp-content/uploads/2021/10/210930-Einladung-Terminology-Service.pdf",
    "measure": "Ellen, S-3",
    "authors": "-",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Example Usecase - Comparison: Greenhouse Gas Reduction Scenarios for Germany",
    "year": 2021,
    "link": "https://doi.org/10.48366/r153801",
    "measure": "Ellen",
    "authors": "Felix Kullmann, Jan Göpfert, Oliver Karras, Patrick Kuckertz, Sören Auer, Markus Stocker, Peter Markewitz, Leander Kotzur, Detlef Stolten",
    "abstract": "I couldn't find an abstract for the document with DOI 10.48366/r153801."
  },
  {
    "title": "Example Usecase - Comparison: Comparison of Scenario Factsheets from the Open Energy Platform",
    "year": 2021,
    "link": "https://doi.org/10.48366/r150337",
    "measure": "Ellen",
    "authors": "Oliver Karras, Jan Göpfert",
    "abstract": "I was unable to locate an abstract for the document associated with DOI 10.48366/r150337."
  },
  {
    "title": "Conference paper: Measurement Extraction with Natural Language Processing: A Review",
    "year": 2022,
    "link": "http://dx.doi.org/10.18653/v1/2022.findings-emnlp.161",
    "measure": "Ellen",
    "authors": "Jan Göpfert, Patrick Kuckertz, Jann M. Weinand, Leander Kotzur, Detlef Stolten",
    "abstract": "Quantitative data is important in many domains. Information extraction methods draw structured data from documents. However, the extraction of quantities and their contexts has received little attention in the history of information extraction. In this review, an overview of prior work on measurement extraction is presented. We describe different approaches to measurement extraction and outline the challenges posed by this task. The review concludes with an outline of potential future research. Research strains in measurement extraction tend to be isolated and lack a common terminology. Improvements in numerical reasoning, more extensive datasets, and the consideration of wider contexts may lead to significant improvements in measurement extraction."
  },
  {
    "title": "Book Chapter: Open Research Data - Beyond Data and Software",
    "year": 2022,
    "link": "Submitted",
    "measure": "Ellen",
    "authors": "Patrick Kuckertz, Heidi Ursula Heinrichs, David Neuroth, Julian Reul, Thomas Grube, Jochen Linßen, Leander Kotzur, Detlef Stolten",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Software Repository: Ecosystem for machine-actionable Software Metadata",
    "year": 2022,
    "link": "https://github.com/FZJ-IEK3-VSA/DataDesc",
    "measure": "Ellen",
    "authors": "-",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "SciKGTeX - A LaTeX Package to Semantically Annotate Contributions in Scientific Publications",
    "year": 2023,
    "link": "https://arxiv.org/abs/2304.05327",
    "measure": "Ellen",
    "authors": "Christof Bless, Ildar Baimuratov, Oliver Karras",
    "abstract": "Scientific knowledge graphs have been proposed as a solution to structure the content of research publications in a machine-actionable way and enable more efficient, computer-assisted workflows for many research activities. Crowd-sourcing approaches are used frequently to build and maintain such scientific knowledge graphs. To contribute to scientific knowledge graphs, researchers need simple and easy-to-use solutions to generate new knowledge graph elements and establish the practice of semantic representations in scientific communication. In this paper, we present a workflow for authors of scientific documents to specify their contributions with a LaTeX package, called SciKGTeX, and upload them to a scientific knowledge graph. The SciKGTeX package allows authors of scientific publications to mark the main contributions of their work directly in LaTeX source files. The package embeds marked contributions as metadata into the generated PDF document, from where they can be extracted automatically and imported into a scientific knowledge graph, such as the ORKG. This workflow is simpler and faster than current approaches, which make use of external web interfaces for data entry. Our user evaluation shows that SciKGTeX is easy to use, with a score of 79 out of 100 on the System Usability Scale, as participants of the study needed only 7 minutes on average to annotate the main contributions on a sample abstract of a published paper. Further testing shows that the embedded contributions can be successfully uploaded to ORKG within ten seconds. SciKGTeX simplifies the process of manual semantic annotation of research contributions in scientific articles. Our workflow demonstrates how a scientific knowledge graph can automatically ingest research contributions from document metadata. ([arxiv.org](https://arxiv.org/abs/2304.05327?utm_source=openai))"
  },
  {
    "title": "The SciQA Scientific Question Answering Benchmark for Scholarly Knowledge",
    "year": 2023,
    "link": "https://doi.org/10.1038/s41598-023-33607-z",
    "measure": "Ellen",
    "authors": "Sören Auer, Dante A. C. Barone, Cassiano Bartz, Eduardo G. Cortes, Mohamad Yaser Jaradeh, Oliver Karras, Manolis Koubarakis, Dmitry Mouromtsev, Dmitrii Pliukhin, Daniil Radyush, Ivan Shilin, Markus Stocker & Eleni Tsalapati ",
    "abstract": "I have located the abstract for the article titled \"The SciQA Scientific Question Answering Benchmark for Scholarly Knowledge,\" published in *Scientific Reports*. The abstract is as follows:\n\n\"Knowledge graphs have gained increasing popularity in the last decade in science and technology. However, knowledge graphs are currently relatively simple to moderate semantic structures that are mainly a collection of factual statements. Question answering (QA) benchmarks and systems were so far mainly geared towards encyclopedic knowledge graphs such as DBpedia and Wikidata. We present SciQA a scientific QA benchmark for scholarly knowledge. The benchmark leverages the Open Research Knowledge Graph (ORKG) which includes almost 170,000 resources describing research contributions of almost 15,000 scholarly articles from 709 research fields. Following a bottom-up methodology, we first manually developed a set of 100 complex questions that can be answered using this knowledge graph. Furthermore, we devised eight question templates with which we automatically generated further 2465 questions, that can also be answered with the ORKG. The questions cover a range of research fields and question types and are translated into corresponding SPARQL queries over the ORKG. Based on two preliminary evaluations, we show that the resulting SciQA benchmark represents a challenging task for next-generation QA systems. This task is part of the open competitions at the 22nd International Semantic Web Conference 2023 as the Scholarly Question Answering over Linked Data (QALD) Challenge.\""
  },
  {
    "title": "Divide and Conquer the EmpiRE: A Community-Maintainable Knowledge Graph of Empirical Research in Requirements Engineering",
    "year": 2023,
    "link": "https://arxiv.org/pdf/2306.16791",
    "measure": "Ellen",
    "authors": "Oliver Karras, Felix Wernlein, Jil Klünder, Sören Auer",
    "abstract": "I have retrieved the abstract from the provided document.\n\n**Abstract—[Background.] Empirical research in requirements engineering (RE) is a constantly evolving topic, with a growing number of publications. Several papers address this topic using literature reviews to provide a snapshot of its “current” state and evolution. However, these papers have never built on or updated earlier ones, resulting in overlap and redundancy. The underlying problem is the unavailability of data from earlier works. Researchers need technical infrastructures to conduct sustainable literature reviews. [Aims.] We examine the use of the Open Research Knowledge Graph (ORKG) as such an infrastructure to build and publish an initial Knowledge Graph of Empirical research in RE (KG-EmpiRE) whose data is openly available. Our long-term goal is to continuously maintain KG-EmpiRE with the research community to synthesize a comprehensive, up-to-date, and long-term available overview of the state and evolution of empirical research in RE. [Method.] We conduct a literature review using the ORKG to build and publish KG-EmpiRE which we evaluate against competency questions derived from a published vision of empirical research in software (requirements) engineering for 2020 – 2025. [Results.] From 570 papers of the IEEE International Requirements Engineering Conference (2000 – 2022), we extract and analyze data on the reported empirical research and answer 16 out of 77 competency questions. These answers show a positive development towards the vision, but also the need for future improvements. [Conclusions.] The ORKG is a ready-to-use and advanced infrastructure to organize data from literature reviews as knowledge graphs. The resulting knowledge graphs make the data openly available and maintainable by research communities, enabling sustainable literature reviews.**"
  },
  {
    "title": "Organizing Scholarly Knowledge in the Open Research Knowledge Graph",
    "year": 2023,
    "link": "https://doi.org/10.52825/CoRDI.v1i.272",
    "measure": "Ellen",
    "authors": "Sören Auer, Markus Stocker, Oliver Karras, Allard Oelen, Jennifer D'Souza, and Anna-Lena Lorenz",
    "abstract": "The Open Research Knowledge Graph (ORKG) is an Open Science digital infrastructure for the production, curation, publication, and reuse of machine-actionable scholarly knowledge. Built on top of the RDF data model and extensible ontologies, the ORKG provides a common vocabulary for researchers to describe their research contributions and data, improving the discoverability and reusability of scholarly knowledge and research data. The ORKG includes tools for visualizing the relationships between different entities, making it easier to understand the connections between different pieces of research and their findings. It facilitates collaboration between researchers by providing a collaborative platform for organizing and sharing scholarly knowledge and data, reducing duplication and enabling more efficient use of resources. As research becomes increasingly data-driven, tools like the ORKG will become essential for enabling efficient, transparent, and collaborative research."
  },
  {
    "title": "\"FAIR-by-Design\" Artifacts: Enriching Publications and Software with FAIR Scientific Information at the Time of Creation",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.8386042",
    "measure": "Ellen",
    "authors": "Oliver Karras, Patrick Kuckertz, Jan Göpfert, Tristan Pelser, Rodrigo Pueblas, Jann M. Weinand, Detlef Stolten, and Sören Auer",
    "abstract": "The abstract for the presentation titled \"FAIR-by-Design\" Artifacts: Enriching Publications and Software with FAIR Scientific Information at the Time of Creation\" is as follows:\n\nIn several research disciplines, the use and development of software have become an integral part, with researchers reporting in publications the results obtained with software and concepts implemented in software. Consequently, publications and software have become two core artifacts in academia with increasing importance for measuring research impact and reputation. The research community has made great efforts to improve digital access to publications and software. However, even now that these artifacts are available in digital form, researchers still encapsulate the scientific information in static and relatively unstructured documents unsuitable for communication. The next step in the digital transformation of scholarly communication requires a more flexible, fine-grained, context-sensitive, and semantic representation of scientific information to be understandable, processable, and usable by humans and machines. Researchers need support in the form of infrastructures, services, and tools to organize FAIR scientific information from publications and software.\n\nSeveral research disciplines work on initiatives to organize scientific information, e.g., machine learning with “Papers-with-Code”, invasion biology with “Hi-Knowledge”, and biodiversity with “OpenBiodiv”. However, these initiatives are often technically diverse and limited to the respective application domain. For this reason, we from the task area Ellen of NFDI4Ing (and in collaboration with NFDI4DataScience and NFDI4Energy) decided to use the Open Research Knowledge Graph (ORKG), an innovative infrastructure for organizing scientific information from publications and software. The ORKG is a cross-discipline research knowledge graph that offers all research communities an easy-to-use and sustainably governed infrastructure. This infrastructure implements best practices, such as FAIR principles and versioning, with services combining manual crowd-sourcing and (semi-)automated approaches to support researchers in producing, curating, processing, and (re-)using FAIR scientific information from publications and software. As a result, organized scientific information is openly available in the long term and can be understood, processed, and used by humans and machines. Thus, research communities can constantly build, publish, maintain, (re-)use, update, and expand organized scientific information in a long-term and collaborative manner.\n\nWhile the ORKG currently focuses on organizing scientific information from published publications and software, we aim to help researchers create “FAIR-by-Design” artifacts to improve their storage, access, and (re-)use, using the ORKG as exemplary infrastructure. The idea of “FAIR-by-Design” artifacts is that the creators of an artifact describe it with extensive and FAIR information once and in parallel to the time of creation. This FAIR information is embedded directly into the artifact to be available to anyone at any time. Specifically, we developed two tools (SciKGTeX for publications and DataDesc for software) that support researchers in the role of author and developer to enrich their publications and software at the time of writing and development with FAIR scientific information embedded into the respective artifact.\n\nSciKGTeX is a LaTeX package to annotate research contributions directly in LaTeX source code. Authors can enrich their publications with structured, machine-actionable, and FAIR scientific information about their research contributions. SciKGTeX embeds the annotated contribution data into the PDF’s XMP metadata so that the FAIR scientific information persists for the lifetime of the artifact.\n\nDataDesc is a toolkit that combines different tools to describe software with machine-actionable metadata. Developers can describe Python software with structured, machine-actionable, and FAIR scientific information about their software. DataDesc embeds the annotated software description into the software’s metadata so that the FAIR scientific information persists for the lifetime of the artifact.\n\nWith these tools, we aim to support researchers in creating “FAIR-by-Design” artifacts to improve their storage, access, and (re-)use."
  },
  {
    "title": "Organizing Scientific Knowledge From Energy System Research Using the Open Research Knowledge Graph",
    "year": 2023,
    "link": "https://arxiv.org/abs/2401.13365",
    "measure": "Ellen",
    "authors": "Oliver Karras, Jan Göpfert, Patrick Kuckertz, Tristan Pelser, Sören Auer",
    "abstract": "Engineering sciences, such as energy system research, play an important role in developing solutions to technical, environmental, economic, and social challenges of our modern society. In this context, the transformation of energy systems into climate-neutral systems is one of the key strategies for mitigating climate change. For the transformation of energy systems, engineers model, simulate and analyze scenarios and transformation pathways to initiate debates about possible transformation strategies. For these debates and research in general, all steps of the research process must be traceable to guarantee the trustworthiness of published results, avoid redundancies, and ensure their social acceptance. However, the analysis of energy systems is an interdisciplinary field as the investigations of large, complex energy systems often require the use of different software applications and large amounts of heterogeneous data. Engineers must therefore communicate, understand, and (re)use heterogeneous scientific knowledge and data. Although the importance of FAIR scientific knowledge and data in the engineering sciences and energy system research is increasing, little research has been conducted on this topic. When it comes to publishing scientific knowledge and data from publications, software, and datasets (such as models, scenarios, and simulations) openly available and transparent, energy system research lags behind other research domains. According to Schmitt et al. and Nieße et al., engineers need technical support in the form of infrastructures, services, and terminologies to improve communication, understanding, and (re)use of scientific knowledge and data."
  },
  {
    "title": "Reviewing accuracy & reproducibility of large-scale wind resource assessments",
    "year": 2023,
    "link": "https://doi.org/10.1016/j.adapen.2023.100158",
    "measure": "Ellen",
    "authors": "Tristan Pelser, Jann Michael Weinand, Patrick Kuckertz, Russell McKenna, Jochen Linssen, Detlef Stolten",
    "abstract": "I'm unable to locate the abstract for the article with DOI 10.1016/j.adapen.2023.100158."
  },
  {
    "title": "Organizing Scientific Knowledge from Engineering Sciences Using the Open Research Knowledge Graph: The Tailored Forming Process Chain Use Case",
    "year": 2024,
    "link": "https://dx.doi.org/10.5334/dsj-2024-052",
    "measure": "Ellen",
    "authors": "Oliver Karras, Laura Budde, Paulina Merkel, Jörg Hermsdorf, Malte Stonis, Ludger Overmeyer, Bernd-Arno Behrens, Sören Auer",
    "abstract": "Background: Engineering sciences are essential for addressing contemporary technical, environmental, and economic challenges. Despite its data-intensive and interdisciplinary nature, the organization of Findable, Accessible, Interoperable, and Reusable (FAIR) scientific knowledge and data in this research field remains understudied. Engineers need infrastructures with services that support them in organizing FAIR scientific knowledge and data for communication and (re-)use.\n\nAim: We explore the use of the Open Research Knowledge Graph (ORKG) as such an infrastructure by demonstrating how engineers can utilize the ORKG in innovative ways for communication and (re-)use.\n\nMethod: For a use case from the Collaborative Research Center 1153 “Tailored Forming”, we collect, extract, and analyze scientific knowledge on 10 Tailored Forming Process Chains (TFPCs) from five publications in the ORKG. In particular, we semantically describe the TFPCs, i.a., regarding their steps, manufacturing methods, measurements, and results. The usefulness of the data extraction topics, their organization, and the relevance of the knowledge described is examined by an expert consultation with 21 experts.\n\nResults: Based on the described knowledge, we build and publish an ORKG comparison as a detailed overview for communication. Furthermore, we (re-)use the knowledge and answer eight competency questions asked by two domain experts. The validation shows a clear agreement of the 21 experts regarding the examined usefulness and relevance.\n\nConclusions: Our use case shows that the ORKG as a ready-to-use infrastructure with services supports researchers, including engineers, in sustainably organizing FAIR scientific knowledge. The direct use of the ORKG by engineers is feasible, so the ORKG is a promising infrastructure for innovative ways of communicating and (re-)using FAIR scientific knowledge in engineering sciences, thus advancing this research field."
  },
  {
    "title": "Energy System Analysis as an ORKG Use Case",
    "year": 2024,
    "link": "https://cuvillier.de/de/shop/publications/9037-open-research-knowledge-graph",
    "measure": "Ellen",
    "authors": "Oliver Karras, Felix Kullmann, Jan Göpfert, Patrick Kuckertz, Jann M. Weinand, Detlef Stolten, Sören Auer",
    "abstract": "I couldn't find an abstract for the publication titled \"Open Research Knowledge Graph\" on the Cuvillier Verlag website. However, the book is available for free download as an e-book under an Open Access CC BY 4.0 license."
  },
  {
    "title": "DataDesc: A framework for creating and sharing technical metadata for research software interfaces",
    "year": 2024,
    "link": "https://doi.org/10.1016/j.patter.2024.101064",
    "measure": "Ellen, NFDI4Energy",
    "authors": "Patrick Kuckertz, Jan Göpfert, Oliver Karras, David Neuroth, Julian Schönau, Rodrigo Pueblas, Stephan Ferenz, Felix Engel, Noah Pflugradt, Jann M. Weinand, Atrid Nieße, Sören Auer, Detlef Stolten",
    "abstract": "I couldn't find the abstract for the article with DOI 10.1016/j.patter.2024.101064."
  },
  {
    "title": "Results on a Survey on Research Software Metadata in the NFDI Consortia",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.12704414",
    "measure": "Ellen, NFDI4Energy",
    "authors": "Castro, L. J., Ferenz, S., Hajiabadi, H., Kuckertz, P., Löbe, M., Schmidt, C., Struck, A., & Thiery, F.",
    "abstract": "This paper presents the results of a survey conducted by the working group on research software metadata within the NFDI (Nationale Forschungsdateninfrastruktur / National Research Data Infrastructure) to gain a better understanding of the requirements and practices for research software metadata in the different NFDI consortia. The survey consisted of four main parts: usage of research software, FAIRness of research software, state of metadata on research software, and artifacts developed to support FAIRness. The survey was distributed to representatives of the 26 NFDI consortia, with responses from 21 of them.\n\nThe survey showed that research software is primarily used for data processing, simulation, and software prototyping. Analysis scripts, libraries, stand-alone software, and web services are the most common software types. Some consortia reported that research software could be considered a research output, while others only viewed it as a supplement to traditional publications.\n\nProper citation of software is crucial for ensuring FAIRness. Approximately half of the domains represented by the surveyed NFDI consortia already use DOIs for citing software. Some domains had not yet fully adopted practices for documenting research software, posing challenges for both developers and users. Researchers typically search for software using generic search engines, academic papers, and community-specific marketplaces where they exist.\n\nIn respect to metadata, only a few domain-specific metadata schemas for research software were identified by the consortia, with generic metadata schemas such as Codemeta, Bioschemas, schema.org, and the Citation File Format being the most commonly mentioned. Relevant metadata elements for research software include algorithms, methods, software/hardware requirements, and tasks performed by the software.\n\nThe survey results will guide activities in the NFDI working group on research software metadata and will also be a relevant foundation for the base service nfdi.software."
  },
  {
    "title": "Organizing Scientific Knowledge from Engineering Sciences Using the Open Research Knowledge Graph: The Tailored Forming Process Chain Use Case",
    "year": 2024,
    "link": "https://doi.org/10.5334/dsj-2024-052",
    "measure": "Ellen",
    "authors": "Oliver Karras, Laura Budde, Paulina Merkel, Jörg Hermsdorf,  Malte Stonis, Ludger Overmeyer, Bernd-Arno Behrens, Sören Auer",
    "abstract": "Background: Engineering sciences are essential for addressing contemporary technical, environmental, and economic challenges. Despite its data-intensive and interdisciplinary nature, the organization of Findable, Accessible, Interoperable, and Reusable (FAIR) scientific knowledge and data in this research field remains understudied. Engineers need infrastructures with services that support them in organizing FAIR scientific knowledge and data for communication and (re-)use.\n\nAim: We explore the use of the Open Research Knowledge Graph (ORKG) as such an infrastructure by demonstrating how engineers can utilize the ORKG in innovative ways for communication and (re-)use.\n\nMethod: For a use case from the Collaborative Research Center 1153 “Tailored Forming”, we collect, extract, and analyze scientific knowledge on 10 Tailored Forming Process Chains (TFPCs) from five publications in the ORKG. In particular, we semantically describe the TFPCs, i.a., regarding their steps, manufacturing methods, measurements, and results. The usefulness of the data extraction topics, their organization, and the relevance of the knowledge described is examined by an expert consultation with 21 experts.\n\nResults: Based on the described knowledge, we build and publish an ORKG comparison as a detailed overview for communication. Furthermore, we (re-)use the knowledge and answer eight competency questions asked by two domain experts. The validation shows a clear agreement of the 21 experts regarding the examined usefulness and relevance.\n\nConclusions: Our use case shows that the ORKG as a ready-to-use infrastructure with services supports researchers, including engineers, in sustainably organizing FAIR scientific knowledge. The direct use of the ORKG by engineers is feasible, so the ORKG is a promising infrastructure for innovative ways of communicating and (re-)using FAIR scientific knowledge in engineering sciences, thus advancing this research field."
  },
  {
    "title": "A Reputation System for Scientific Contributions Based on a Token Economy",
    "year": 2024,
    "link": "https://doi.org/10.1007/978-3-031-72437-4_3",
    "measure": "Ellen",
    "authors": "Bless, C., Denzler, A., Karras, O., Auer, S.",
    "abstract": "One way of determining the reputation of a scientist is by assessing the portfolio of their publications in peer-reviewed journals and conferences. However, this reputation is an incomplete measure of achievement and creates a variety of misaligned incentives that negatively influence the scientific process and cause an increased distribution of low-quality research content. In this paper, we point out some current problems in the scientific process, how they are linked to the behavioral patterns of optimizing bibliographic metrics, and present a possible solution in the form of a reputation token system. The solution is characterized by a token economy with mechanisms to create stronger incentives for high-quality contributions and deter fraud. We provide a prototypical implementation of the reputation token as a smart contract for the Ethereum blockchain with a user interface and network visualization."
  },
  {
    "title": "SWARM-SLR - Streamlined Workflow Automation for Machine-Actionable Systematic Literature Reviews",
    "year": 2024,
    "link": "https://doi.org/10.1007/978-3-031-72437-4_2",
    "measure": "Ellen",
    "authors": "Wittenborg, T., Karras, O., Auer, S.",
    "abstract": "Authoring survey or review articles still requires significant tedious manual effort, despite many advancements in research knowledge management having the potential to improve efficiency, reproducibility, and reuse. However, these advancements bring forth an increasing number of approaches, tools, and systems, which often cover only specific stages and lack a comprehensive workflow utilizing their task-specific strengths. We propose the Streamlined Workflow Automation for Machine-actionable Systematic Literature Reviews (SWARM-SLR) to crowdsource the improvement of SLR efficiency while maintaining scientific integrity in a state-of-the-art knowledge discovery and distribution process. The workflow aims to domain-independently support researchers in collaboratively and sustainably managing the rising scholarly knowledge corpus. By synthesizing guidelines from the literature, we have composed a set of 65 requirements, spanning from planning to reporting a review. Existing tools were assessed against these requirements and synthesized into the SWARM-SLR workflow prototype, a ready-for-operation software support tool. The SWARM-SLR was evaluated via two online surveys, which largely confirmed the validity of the 65 requirements and situated 11 tools to the different life-cycle stages. The SWARM-SLR workflow was similarly evaluated and found to be supporting almost the entire span of an SLR, excelling specifically in search and retrieval, information extraction, knowledge synthesis, and distribution. Our SWARM-SLR requirements and workflow support tool streamlines the SLR support for researchers, allowing sustainable collaboration by linking individual efficiency improvements to crowdsourced knowledge management. If these efforts are continued, we expect the increasing number of tools to be manageable and usable inside fully structured, (semi-)automated literature review workflows."
  },
  {
    "title": "KG-EmpiRE: A Community-Maintainable Knowledge Graph\nfor a Sustainable Literature Review on the State and Evolution\nof Empirical Research in Requirements Engineering",
    "year": 2024,
    "link": "https://dx.doi.org/10.1109/RE59067.2024.00063",
    "measure": "Ellen",
    "authors": "Oliver Karras",
    "abstract": "I couldn't find an abstract for the document with DOI 10.1109/RE59067.2024.00063."
  },
  {
    "title": "Promotion of Open Science in Requirements Engineering:\nLeveraging the Open Research Knowledge Graph\nfor FAIR Scientific Information",
    "year": 2024,
    "link": "https://dx.doi.org/10.15488/17809",
    "measure": "Ellen",
    "authors": "Oliver Karras, Alessio Ferrari, Davide Fucci, and Davide Dell’Anna",
    "abstract": "I'm sorry, but I couldn't find an abstract for the document associated with DOI 10.15488/17809."
  },
  {
    "title": "Opportunities for large language models and discourse in engineering design",
    "year": 2024,
    "link": "https://doi.org/10.1016/j.egyai.2024.100383",
    "measure": "Ellen",
    "authors": "Jan Göpfert, Jann M. Weinand, Patrick Kuckertz, Detlef Stolten",
    "abstract": "I couldn't find the abstract for the article with DOI 10.1016/j.egyai.2024.100383."
  },
  {
    "title": "Literature Review Data for Accuracy and Reproducibility of Wind Potential Assessments",
    "year": 2023,
    "link": "https://doi.org/10.26165/JUELICH-DATA/FXM9CB",
    "measure": "Ellen",
    "authors": "Tristan Pelser, Patrick Kuckertz, Jann Michael Weinand, Detlef Stolten",
    "abstract": "The dataset titled \"Literature Review Data for Accuracy and Reproducibility of Wind Potential Assessments\" contains data from a literature review on large-scale wind potential assessments conducted between 2012 and 2022. It includes technical and content information related to accuracy and reproducibility. The authors acknowledge funding and support from the German Federal Government, the German State Governments, and the Joint Science Conference (GWK) as part of the NFDI4Ing consortium. This work was also supported by the German Research Foundation (DFG) – 442146713 and the Helmholtz Association under the program “Energy System Design”. The dataset is associated with the publication: Pelser, T., Weinand, J.M., Kuckertz, P., McKenna, R., Linssen, J., Stolten, D. (2023) Reviewing accuracy & reproducibility of large-scale wind resource assessments. Advances in Applied Energy Volume 13, February 2024, 100158. doi: 10.1016/j.adapen.2023.100158."
  },
  {
    "title": "REFLOW: Renewable Energy potentials workFLOW manager",
    "year": 2024,
    "link": "https://github.com/FZJ-IEK3-VSA/ethos.REFLOW",
    "measure": "Ellen",
    "authors": "Tristan Pelser, Patrick Kuckertz, Jann Michael Weinand, Detlef Stolten",
    "abstract": "The GitHub repository at https://github.com/FZJ-IEK3-VSA/ethos.REFLOW hosts REFLOW, a workflow manager tool designed to streamline and automate tasks related to renewable energy potential analyses. Built with Luigi, REFLOW provides an automated, robust framework for data acquisition, processing, land/sea eligibility analysis, technology placements, simulations, and visualizations, emphasizing transparency and reproducibility.\n\n**Requirements:**\n\n- Python\n- An IDE (e.g., PyCharm, Visual Studio Code)\n- Unix-like system or bash on Windows\n- Optional: Docker Desktop if running\n\nFor more detailed information, please refer to the repository's README file."
  },
  {
    "title": "A metadata crawler for simulation data management",
    "year": 2021,
    "link": "https://gitlab.lrz.de/nfdi4ing/crawler ",
    "measure": "Doris",
    "authors": "Ralev, Radoslav | Hoppe, Nils | Chiapparino, Giuseppe | Farnbacher, Benjamin | Stemmer, Christian\n",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Data Management Plan: Generic Template with Extension for High Performance Measurement and Computing",
    "year": 2021,
    "link": "https://zenodo.org/record/5801838#.YeAysf7MKUk ",
    "measure": "Doris",
    "authors": "Hora, Manuel | Farnbacher, Benjamin",
    "abstract": "This data management plan (DMP) template has been created within the context of the consortium NFDI4Ing - the National Research Data Infrastructure for Engineering Sciences. Target group are engineers conducting and post-processing high-resolution and high-performance measurements and simulations on high performance computing systems (HPC), represented by the NFDI4Ing archetype DORIS. This template is based on standards and best practices at Technical University of Munich (TUM). Most of the queries are generic and can be transferred to different institutions and disciplines, even though most of the linked guidelines are institutional. Browsing appropriate institutional policies should accompany the draft of a new data management plan. This data management plan template is generic for all kind of research domains. The special high performance measurement and computing (HPMC) queries are outlined on the last page."
  },
  {
    "title": "Lehrveranstaltung: Einführung in das Forschungsdatenmanagement für Studierende der Ingenieurwissenschaften",
    "year": 2022,
    "link": "https://campus.tum.de/tumonline/pl/ui/$ctx/WBMODHB.wbShowMHBReadOnly?pKnotenNr=3032258&pOrgNr=15307",
    "measure": "Doris",
    "authors": "verschiedene (Lehrveranstaltung)",
    "abstract": "I'm unable to access the specific course information from the provided TUMonline link, as it requires login credentials. However, based on the parameters in the URL, it appears to pertain to a course or module offered by the Chair of Automotive Technology at the Technical University of Munich (TUM).\n\nThe Chair of Automotive Technology at TUM focuses on various aspects of vehicle engineering, including autonomous driving, battery diagnostics for electric vehicles, and sensor analysis for object detection. Recent publications from the chair include:\n\n- \"Analyzing the Impact of Simulation Fidelity on the Evaluation of Autonomous Driving Motion Control\"\n- \"Battery Pack Diagnostics for Electric Vehicles: Transfer of Differential Voltage and Incremental Capacity Analysis from Cell to Vehicle Level\"\n- \"Camera-LiDAR Inconsistency Analysis for Active Learning in Object Detection\"\n\nThese publications highlight the chair's commitment to advancing research in automotive technology.\n\nFor detailed information about the specific course or module, I recommend logging into TUMonline with your credentials or contacting the Chair of Automotive Technology directly."
  },
  {
    "title": "Workshops, Konferenz- und Tagungsbeiträge",
    "year": "2021, 2022",
    "link": "https://www.epc.ed.tum.de/aer/forschungsgruppen/nfdi4ing/",
    "measure": "Doris",
    "authors": "verschiedene (Konferenzbeiträge etc.)",
    "abstract": "The NFDI4Ing initiative at the Chair of Aerodynamics and Fluid Mechanics focuses on the DORIS archetype, which addresses high-performance measurements and computations involving very large datasets. The primary goal is to make HPC research data findable, accessible, interoperable, and reusable (FAIR). Due to the substantial size of these datasets—ranging from hundreds of terabytes to petabytes—custom software solutions are developed to facilitate data management directly on HPC systems. Key objectives include ensuring data security and sovereignty, supporting third-party users through training and post-processing tools, defining metadata standards, providing storage and archiving solutions for large datasets, and enhancing reproducibility on large-scale HPC systems. ([epc.ed.tum.de](https://www.epc.ed.tum.de/en/aer/research-groups/nfdi4ing/?utm_source=openai))"
  },
  {
    "title": "Handreichung zu rechtlichen Aspekten des Forschungsdatenmanagements",
    "year": 2022,
    "link": "https://mediatum.ub.tum.de/1690463\t\n",
    "measure": "Doris",
    "authors": "Katja Kessler, Dr. Sebastian Öder, Dr. Sascha Grusche",
    "abstract": "I couldn't find an abstract for the document titled \"Handreichung zu rechtlichen Aspekten des Forschungsdatenmanagements\" authored by Katja Kessler, Dr. Sebastian Öder, and Dr. Sascha Grusche. The document, published in October 2022, focuses on legal aspects of research data management, covering topics such as copyright, data protection, and patents. It was funded by the Deutsche Forschungsgemeinschaft (DFG) under project number 442146713. The document is available in German on mediaTUM, the media and publication server of the Technical University of Munich. An English version is also available."
  },
  {
    "title": "Using Data Science Storage via TUM Workbench - A How-to Guide",
    "year": 2022,
    "link": "https://mediatum.ub.tum.de/1639257",
    "measure": "Doris",
    "authors": "Katja Kessler, Martin Fischer, Fabian Pichlmaier",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Handreichung zu rechtlichen Aspekten des Forschungsdatenmanagements",
    "year": 2022,
    "link": "https://doi.org/10.14459/2022md1690463",
    "measure": "Doris",
    "authors": "Katja Kessler, Dr. Sebastian Öder, Dr. Sascha Grusche ",
    "abstract": "I have located the document titled \"Handreichung zu rechtlichen Aspekten des Forschungsdatenmanagements\" authored by Katja Kessler, Dr. Sebastian Öder, and Dr. Sascha Grusche.  However, the abstract is not available in the provided information."
  },
  {
    "title": "Workshop: Research Data Management for Data from HPC",
    "year": 2023,
    "link": "https://zenodo.org/record/7785532#.ZDlQ_s7P2Ul",
    "measure": "Doris",
    "authors": "Apweiler, Sander; Bönisch, Thomas; Chiapparino, Giuseppe; Farnbacher, Benjamin; Grusche, Sascha; Hachinger, Stephan; Huskova, Nadiia; Kunkel, Julian; Sdralia, Vasiliki; Stemmer, Christian; Trumpik, Noah",
    "abstract": "This workshop shows techniques on how to structure, document and publish your research data and which tools and resources can support you. This workshop will introduce researchers to the basics of research data management (RDM) as well as tools and systems available at different HPC centers. It presents knowledge of tools and services for data and metadata collection, storage, publication and transfer of large data.\n\nThis supports bookkeeping in research, exchange with colleagues and dissemination and use of research data with external partners. Publishing research data along journal publications will soon become commonplace and will allow for a wider range of use of comparative research data within the course of your PhD.\n\n**Topics**\n\n- Basics in research data management: FAIR data principles, metadata & terminology, repositories, identifier (DOI), licenses, best-practice\n- NHR Alliance and consortium NFDI4Ing\n- Hardware systems, storage systems, data transfer tools at the different HPC centers (e.g. SuperMUC-NG, Hawk, JUWELS & JURECA, ZIH/TU Dresden, Grete/GWDG)\n- Research data management tools and services for data from HPC: Metadata standards, metadata crawling, interfaces, repositories, containerization, FAIR HPC data, B2SHARE, InHPC-DE etc."
  },
  {
    "title": "Metadata4Ing: An ontology for describing the generation of research data within a scientific activity.",
    "year": 2022,
    "link": "https://zenodo.org/record/5957104#.Y00ih0zP2Uk",
    "measure": "diverse",
    "authors": "diverse, siehe: https://zenodo.org/record/5957104#.Y00ih0zP2Uk",
    "abstract": "The ontology Metadata4Ing is developed within the NFDI Consortium NFDI4Ing with the aim of providing a thorough framework for the semantic description of research data, with a particular focus on engineering sciences and neighbouring disciplines. This ontology allows a thorough description of the whole data generation process (experiment, observation, simulation), embracing the object of investigation, all sample and data manipulation procedures, a summary of the data files and the information contained, and all personal and institutional roles. The subordinate classes and relations can be built according to the two principles of inheritance and modularity. Inheritance means that a subclass inherits all properties of its superordinate class, possibly adding some new ones. Modularity means that all expansions are independent of each other; this makes possible for instance to generate expanded ontologies for any possible combinations of method × object of research."
  },
  {
    "title": "From Ontology to Metadata: A Crawler for Script-based Workflows",
    "year": 2023,
    "link": "https://preprints.inggrid.org/repository/view/12/",
    "measure": "D-3",
    "authors": "Giuseppe Chiapparino , Benjamin Farnbacher, Nils Hoppe, Radoslav Ralev, Vasiliki Sdralia, Christian Stemmer ",
    "abstract": "The present work introduces HOMER (High Performance Measurement and Computing tool for Ontology-based Metadata Extraction and Re-use), a python-written metadata crawler that allows to automatically retrieve relevant research metadata from script-based workflows on HPC systems. The tool offers a flexible approach to metadata collection, as the metadata scheme can be read out from an ontology file. Through minimal user input, the crawler can be adapted to the user's needs and easily implemented within the workflow, enabling to retrieve relevant metadata. The obtained information can be further automatically post-processed. For example, strings may be trimmed by regular expressions or numerical values may be averaged. Currently, data can be collected from text-files and HDF5 files, as well as directly hardcoded by the user. However, the tool has been designed in a modular way, so that it allows straightforward extension of the supported file-types, the instruction processing routines and the post-processing operations."
  },
  {
    "title": "NFDI4Ing Conference 2021 - Collection of Abstracts",
    "year": 2021,
    "link": "https://doi.org/10.5281/zenodo.7740936",
    "measure": "CC-44 / CC-45",
    "authors": "Berger, Marco; Linxweiler, Jan; Roski, Stefanie\n",
    "abstract": "The document titled \"NFDI4Ing Conference 2021 - Collection of Abstracts\" is a compilation of abstracts from the NFDI4Ing Conference held on September 27 and 28, 2021. The conference website is available at http://nfdi4ing.de/konferenz. The editors of this collection are Marco Berger, Jan Linxweiler, and Stefanie Roski. The authors acknowledge funding and support from the Federal Government and the Heads of Government of the Länder, as well as the Joint Science Conference (GWK), within the framework of the NFDI4Ing consortium. The project is funded by the German Research Foundation (DFG) under project number 442146713."
  },
  {
    "title": "Report: Community CC-44 Elektro-, Verkehrs-, Systemtechnik und Informatik Arbeitsbericht 2021/2022",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.7129431",
    "measure": "CC-44",
    "authors": " Berger, Marco; Gerike, Regine; Langenbach, Christian; Roski, Stefanie; Hecker, David; Fuchs, Matthias; Würzner, Kay.Michael",
    "abstract": "The document titled \"Community CC-44 Elektro-, Verkehrs-, Systemtechnik und Informatik Arbeitsbericht 2021/2022\" is a report authored by Marco Berger, Regine Gerike, Christian Langenbach, Stefanie Roski, David Hecker, Matthias Fuchs, and Kay.Michael Würzner. It was published on September 30, 2022, and is available under the Creative Commons Attribution 4.0 International license. The report is associated with the NFDI4Ing community and focuses on research data management (RDM) and related topics. The full text of the report can be accessed and downloaded from Zenodo at the following link: ."
  },
  {
    "title": "Proceedings of the NFDI4Ing Conference 2023 - Innovation in Research Data Management: Bridging the gaps between disciplines and opening new perspectives for research in engineering science",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.10036957",
    "measure": "CC-44",
    "authors": "Roski, Stefanie; Gerike, Regine_x000D_\n",
    "abstract": "The NFDI4Ing Conference 2023 provided a platform for discussing recent innovations and practices in Research Data Management for engineering sciences. The conference brought together researchers in engineering sciences and experts in Research Data Management, facilitating exchanges on requirements, solutions, and best practices. The ultimate goal was to strengthen interdisciplinary networks and generate new ideas for future Research Data Management. The conference, which took place online, was conducted in English."
  },
  {
    "title": "NFDI4Ing Conference 2023 - Innovation in Research Data Management: Bridging the gaps between disciplines and opening new perspectives for research in engineering science",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.10033863",
    "measure": "CC-44",
    "authors": "Roski, Stefanie",
    "abstract": "The NFDI4Ing Conference 2023, held online on September 27-28, 2023, provided an outstanding opportunity to exchange insights, facilitate collaboration, and drive forward the advancement of knowledge in the realm of research data management within the engineering community."
  },
  {
    "title": "Data Set NFDI4Ing Community Survey 2023",
    "year": NaN,
    "link": "https://doi.org/10.5281/zenodo.10598900 ",
    "measure": "CC-3-2",
    "authors": "Jan Linxweiler, Tom Hensel, Katja Wermbter",
    "abstract": "The dataset titled \"NFDI4Ing Community Survey 2023\" includes the questionnaire and anonymized raw data from a survey conducted between September 27, 2023, and December 22, 2023. The survey covers topics such as Research Data Management (RDM) knowledge and application, need for services and support, data and software, workflow and strategy, governance concepts in the engineering sciences, and socio-economic information. The authors acknowledge support from the Federal Government and the Heads of Government of the Länder, as well as the Joint Science Conference (GWK), within the framework of the NFDI4Ing consortium (German Research Foundation (DFG) - project number 442146713)."
  },
  {
    "title": "Data Set NFDI4Ing Community Survey 2022",
    "year": NaN,
    "link": "https://doi.org/10.5281/zenodo.10597988",
    "measure": "CC-3-2",
    "authors": "Jan Linxweiler, Tom Hensel",
    "abstract": "The dataset titled \"NFDI4Ing Community Survey 2022\" includes the questionnaire and anonymized raw data from a survey conducted between October 26, 2022, and December 16, 2022. The survey covered topics such as Data Literacy Right from the Start, Governance Concept for Research Data Management (RDM) in Engineering, Handling of Research Data, General Questions about Research Data, Need for Services in RDM, and General Information. The authors acknowledge the support of the Federal Government and the Heads of Government of the Länder, as well as the Joint Science Conference (GWK), within the framework of the NFDI4Ing consortium (German Research Foundation (DFG) - project number 442146713)."
  },
  {
    "title": "HeFDI Code School: Sustainable Research Software - Scientific Software Development is not a Jenga game!",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.7924802",
    "measure": "CC-3/CC-45",
    "authors": "Jan Linxweiler, Sven Marcus, Sören Peters",
    "abstract": "The document titled \"HeFDI Code School: Sustainable Research Software - Scientific Software Development is not a Jenga game!\" is a presentation published on October 27, 2023, by Jan Linxweiler, Sven Marcus, and Sören Peters from TU Braunschweig. It addresses the importance of scientific software in research, emphasizing its role in understanding and reusing data, as well as ensuring reproducibility of results. The HeFDI Code School aims to equip early career researchers with skills to develop high-quality, reusable, and sustainable scientific software through a series of workshops. The first workshop, held on May 12 and October 27, focuses on bridging the gap between scientific and software engineering communities by introducing practices and principles for maintainable and sustainable software development."
  },
  {
    "title": "HeFDI Code School: Sustainable Research Software - Clean Code and Refactoring",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.7972817",
    "measure": "CC-3/CC-45",
    "authors": "Sven Marcus, Sören Peters, Jan Linxweiler",
    "abstract": "I found the following description for the resource associated with DOI 10.5281/zenodo.7972817:\n\n\"Scientific software is in many disciplines crucial for understanding and reusing research data and a cornerstone for reproducibility of research results. The HeFDI Code School addresses the need of especially early career researchers on learning how to create good scientific software and increase the quality of their code for better reusability and sustainability.\"\n\nThis resource is titled \"HeFDI Code School: Sustainable Research Software - Clean Code and Refactoring\" and was published on November 10, 2023.\n\nYou can access the full resource here:"
  },
  {
    "title": "HeFDI Code School: Sustainable Research Software - Introduction to Software Testing",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.8069917",
    "measure": "CC-3/CC-45",
    "authors": "Harikrishnan Sreekumar, Yannik Hüpel",
    "abstract": "The document titled \"HeFDI Code School: Sustainable Research Software - Introduction to Software Testing\" is a presentation published on November 22, 2023, by Harikrishnan Sreekumar and Yannik Hüpel from Technische Universität Braunschweig. It is part of the HeFDI Code School series, which addresses the need for early career researchers to learn how to create high-quality scientific software to enhance reproducibility and sustainability. This particular workshop, held on November 24, focuses on introducing software testing for scientific codes, covering fundamentals, writing various types of tests, and test process automation. The presentation and related materials are available under a Creative Commons Attribution 4.0 International license."
  },
  {
    "title": "HeFDI Code School: Sustainable Research Software - Continuous Integration and Test Driven Development",
    "year": 2023,
    "link": "https://doi.org/10.5281/zenodo.8119397",
    "measure": "CC-3/CC-45",
    "authors": "Jan Linxweiler, Moritz Schwarzmeier, Sören Peters, Sven Marcus",
    "abstract": "Continuous Integration (CI) and Test-driven development (TDD) are two software development practices that complement each other and can be used together to improve the quality and efficiency of software development.\n\nCI is a development practice that emphasizes integrating and testing code changes frequently in a shared repository. The goal is to catch bugs and issues early in the development process before they become more difficult and expensive to fix.\n\nTDD, on the other hand, is a development approach that emphasizes writing automated tests before writing the code. The developer writes a failing test, then writes the code to make the test pass, and finally refactors the code to improve its quality. This cycle is repeated for each new feature or change to the code.\n\nWhen used together, CI and TDD can help to ensure that the code is always in a functional and deployable state and that any issues or bugs are caught early in the development process."
  },
  {
    "title": "Lehrveranstaltung Praktikum Digitalisierung",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.5669216 ",
    "measure": "CC-2, Alex",
    "authors": NaN,
    "abstract": "The document titled \"Datenkompetenz von Anfang an! Maschinenbau, Sustainable Engineering\" is a presentation by Peter F. Pelz and Manuela Richter from Technische Universität Darmstadt. It discusses the importance of FAIR data as a key resource in the 21st century, emphasizing their role in enabling transparency, sustainability, science, and economy. The presentation outlines how data competence is integrated into the Bachelor's program in Mechanical Engineering at TU Darmstadt. The authors acknowledge support from the German Research Foundation (DFG) under project number 442146713."
  },
  {
    "title": "Lehrveranstaltung Grundlagen der Digitalisierung",
    "year": 2021,
    "link": "https://www.fzd.tu-darmstadt.de/studies/lectures_fzd/bachelor_1/fundamentals_of_digitalisation/fundamentals_of_digitalisation.en.jsp",
    "measure": "CC-2, Alex",
    "authors": "Kevin Logan, Ning Xia, Peter Pelz",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Reference implementation of SciMesh in the samples database software JuliaBase",
    "year": 2022,
    "link": "https://doi.org/10.5281/zenodo.7357884",
    "measure": "Caden",
    "authors": "Torsten Bronger",
    "abstract": "The DOI 10.5281/zenodo.7357884 corresponds to the software titled \"Reference implementation of SciMesh in the samples database software JuliaBase.\" The description provided is:\n\n\"This is the ELN/samples database software 'JuliaBase', extended to be able to export its data in form of an RDF graph. This graph uses SciMesh as its basic schema. See the file 'Graph export.rst' for instructions of graph extraction.\"\n\nAn abstract is not available for this software."
  },
  {
    "title": "SciMesh: RDF graphs for scientific knowledge",
    "year": 2022,
    "link": "http://hdl.handle.net/2128/32788",
    "measure": "Caden",
    "authors": "Torsten Bronger, Michael Flemming, Hartmut Schlenz, Michael Selzer, Manideep Jayavarapu",
    "abstract": "SciMesh is a set of specifications that define the representation of scientific results in form of a knowledge graph. While many such data formats focus on simulation data, SciMesh explicitly includes physical specimens as first-class citizens. Thus, provenance of both data and specimens can be documented. SciMesh’s immediate purpose is to represent content of electronic lab notebooks (ELNs) for sharing scientific results across ELN instances. This way, collaboration partners running different ELNs (even different ELN software) can have a uniform view on their collective results without media disruptions."
  },
  {
    "title": "A Research Software Engineering Workflow for Computational Science and Engineering",
    "year": 2022,
    "link": "https://arxiv.org/abs/2208.07460",
    "measure": "Betty & S-2",
    "authors": "Tomislav Maric, Dennis Gläser, Jan-Patrick Lehr, Ioannis Papagiannidis, Benjamin Lambie, Christian Bischof, Dieter Bothe",
    "abstract": "University research groups in Computational Science and Engineering (CSE) generally lack dedicated funding and personnel for Research Software Engineering (RSE), which, combined with the pressure to maximize the number of scientific publications, shifts the focus away from sustainable research software development and reproducible results. The neglect of RSE in CSE at University research groups negatively impacts the scientific output: research data - including research software - related to a CSE publication cannot be found, reproduced, or re-used, different ideas are not combined easily into new ideas, and published methods must very often be re-implemented to be investigated further. This slows down CSE research significantly, resulting in considerable losses in time and, consequentially, public funding.\n\nWe propose a RSE workflow for Computational Science and Engineering (CSE) that addresses these challenges, that improves the quality of research output in CSE. Our workflow applies established software engineering practices adapted for CSE: software testing, result visualization, and periodical cross-linking of software with reports/publications and data, timed by milestones in the scientific publication process. The workflow introduces minimal work overhead, crucial for university research groups, and delivers modular and tested software linked to publications whose results can easily be reproduced. We define research software quality from a perspective of a pragmatic researcher: the ability to quickly find the publication, data, and software related to a published research idea, quickly reproduce results, understand or re-use a CSE method, and finally extend the method with new research ideas."
  },
  {
    "title": "Evaluation of tools for describing, reproducing and reusing scientific workflows",
    "year": 2022,
    "link": "https://arxiv.org/abs/2211.06429",
    "measure": "Betty ",
    "authors": "Philipp Diercks, Dennis Gläser, Ontje Lünsdorf, Michael Selzer, Bernd Flemisch, Jörg F. Unger",
    "abstract": "In the field of computational science and engineering, workflows often entail the application of various software, for instance, for simulation or pre- and postprocessing. Typically, these components have to be combined in arbitrarily complex workflows to address a specific research question. In order for peer researchers to understand, reproduce and (re)use the findings of a scientific publication, several challenges have to be addressed. For instance, the employed workflow has to be automated and information on all used software must be available for a reproduction of the results. Moreover, the results must be traceable and the workflow documented and readable to allow for external verification and greater trust. In this paper, existing workflow management systems (WfMSs) are discussed regarding their suitability for describing, reproducing and reusing scientific workflows. To this end, a set of general requirements for WfMSs were deduced from user stories that we deem relevant in the domain of computational science and engineering. On the basis of an exemplary workflow implementation, publicly hosted at GitHub (https://github.com), a selection of different WfMSs is compared with respect to these requirements, to support fellow scientists in identifying the WfMSs that best suit their requirements."
  },
  {
    "title": "Evaluation of workflow tools for computational scientific workflows",
    "year": 2021,
    "link": "https://github.com/BAMresearch/NFDI4IngScientificWorkflowRequirements",
    "measure": "Betty",
    "authors": "Philipp Diercks, Dennis Gläser",
    "abstract": "In the field of computational science and engineering, workflows often entail the application of various software, for instance, for simulation or pre- and postprocessing. Typically, these components have to be combined in arbitrarily complex workflows to address a specific research question. In order for peer researchers to understand, reproduce and (re)use the findings of a scientific publication, several challenges have to be addressed. For instance, the employed workflow has to be automated and information on all used software must be available for a reproduction of the results. Moreover, the results must be traceable and the workflow documented and readable to allow for external verification and greater trust. In this paper, existing workflow management systems (WfMSs) are discussed regarding their suitability for describing, reproducing and reusing scientific workflows. To this end, a set of general requirements for WfMSs were deduced from user stories that we deem relevant in the domain of computational science and engineering. On the basis of an exemplary workflow implementation, publicly hosted at GitHub (https://github.com/BAMresearch/NFDI4IngScientificWorkflowRequirements), a selection of different WfMSs is compared with respect to these requirements, to support fellow scientists in identifying the WfMSs that best suit their requirements."
  },
  {
    "title": "Python tool for regression testing in software (especially simulation software)",
    "year": 2022,
    "link": "https://gitlab.com/dglaeser/fieldcompare",
    "measure": "Betty",
    "authors": "Dennis Gläser",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Education material around sustainable software development",
    "year": 2022,
    "link": "https://gitlab.com/sustainable-simulation-software/course-material",
    "measure": "Betty",
    "authors": "Dennis Gläser, Bernd Flemisch",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Material for one-week course on research software development",
    "year": 2022,
    "link": "https://github.com/RSE-102/",
    "measure": "Betty",
    "authors": "Benjamin Ükermann, Bernd Flemisch, Dennis Gläser, Ishaan Desai",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Betty's (re)search engine",
    "year": 2022,
    "link": "http://nfdi4ing.rz-housing.tu-clausthal.de/",
    "measure": "Betty",
    "authors": "Vasiliy Seibert, Stefan Wittek, Andreas Rausch",
    "abstract": "I couldn't find an abstract for the provided DOI."
  },
  {
    "title": "GridFormat: Header-only C++-Library for grid file I/O",
    "year": 2023,
    "link": "https://doi.org/10.21105/joss.05778",
    "measure": "Betty",
    "authors": "Dennis Gläser, Timo Koch, Bernd Flemisch",
    "abstract": "I couldn't find an abstract for the article with DOI 10.21105/joss.05778."
  },
  {
    "title": "Betty’s (Re)Search Engine: A client-based search engine for research software stored in repositories.",
    "year": 2024,
    "link": "https://doi.org/10.48694/inggrid.3953",
    "measure": "Betty",
    "authors": "Vasiliy Seibert orcid logo (Institute for Software and Systems Engineering, TU Clausthal)  , Andreas Rausch (Institute for Software and Systems Engineering, TU Clausthal) , Stefan Wittek (Institute for Software and Systems Engineering, TU Clausthal)",
    "abstract": "Promoting research, without providing the source code that was used to conduct the research, means a greater effort for every researcher down the line. Existing solutions that aim to make research software FAIR [1], fail to provide a wholesome solution, for they do not sufficiently consider already existing research software stored on platforms like GitHub or organizational GitLabs. We therefore present Betty’s research engine, a client-based implementation of a cascading search process, that first finds research software stored on platforms like GitHub and then links them to corresponding publications or entries in third party databases. We evaluated 400 random search results from the domain of ecology and found that 345 out of 400 repositories made a reference to a corresponding publication / entry in third party database and therefore clearly indicating the potential of the cascading search. Betty’s research engine is live and openly available under this URL: http://nfdi4ing.rz-housing.tu-clausthal.de/)"
  },
  {
    "title": "Service: Self-documenting software - prototype test phase ",
    "year": 2022,
    "link": "-",
    "measure": "Alex/A-4-2\t\t",
    "authors": "Steven Wagner, Philip Linke",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Checkliste – Mess- und Datenplanung für das maschinelle Lernen in der Montage",
    "year": 2022,
    "link": "https://zenodo.org/record/6943476#.Y0ffbHZBxD8",
    "measure": "Alex\t",
    "authors": "Christopher Schnur, Anne Blum, Steffen Klein",
    "abstract": "The document titled \"Checkliste – Mess- und Datenplanung für das maschinelle Lernen in der Montage\" is available at https://zenodo.org/record/6943476. It provides a checklist to assist industrial users, particularly in small and medium-sized enterprises, in collecting high-quality data for machine learning applications in assembly processes. The checklist aims to minimize analysis effort and enhance result significance by guiding the planning of machine learning projects in existing assembly systems. It focuses on recording valid data efficiently and offers a basic overview of data analysis methods. The primary target audience includes manufacturing SMEs and large enterprises. An English version of the checklist is available at https://www.zenodo.org/record/7556876."
  },
  {
    "title": "Service: FDM compliant storage - RSM data cente",
    "year": "since 2019 continuously",
    "link": "-",
    "measure": "Alex",
    "authors": "Steven Wagner, Philip Linke",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "plotID Matlab",
    "year": 2021,
    "link": "https://git.rwth-aachen.de/plotid/plot_identifier",
    "measure": "Alex",
    "authors": "Martin Hock et al",
    "abstract": "The link you provided directs to the GitLab repository for the plotID toolkit, a tool designed to assist researchers in tracking and storing relevant data in plots. By labeling plots with an ID and exporting them along with processed data and code, plotID aims to enhance reproducibility and data management in research. The repository includes implementations in both MATLAB and Python, with the MATLAB version reaching a stable release (V1.0) in March 2022. The Python version, as of April 2023, is in an alpha state (V0.2.1) and is available as a package on PyPI. For more detailed information, including documentation and examples, you can visit the GitLab repository: ([git.rwth-aachen.de](https://git.rwth-aachen.de/plotid?utm_source=openai))."
  },
  {
    "title": "plotID Python",
    "year": 2022,
    "link": "https://git.rwth-aachen.de/plotid/plotid_python",
    "measure": "Alex",
    "authors": "Martin Hock et al",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Alex gitlab pages ",
    "year": 2021,
    "link": "https://ta_alex.pages.rwth-aachen.de/action-items/",
    "measure": "Alex",
    "authors": "Martin Hock, Michaela Leštáková et al",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "pyKraken",
    "year": 2022,
    "link": "https://git.rwth-aachen.de/fst-tuda/public/pykkn",
    "measure": "Alex",
    "authors": "Martin Hock, Nils Preuß  et al",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "HDF5-Workshop",
    "year": 2020,
    "link": "https://ta_alex.pages.rwth-aachen.de/action-items/presentations/#hdf5-workshop",
    "measure": "Alex",
    "authors": "Nils Preuß",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Python Styleguide for Researchers",
    "year": 2022,
    "link": "https://ta_alex.pages.rwth-aachen.de/action-items/action-items/37_styleguide_py/",
    "measure": "Alex",
    "authors": "Michaela Leštáková, ",
    "abstract": "The \"Mini Styleguide für Python\" is a concise guide aimed at promoting consistent and high-quality Python code, particularly beneficial for team projects. It emphasizes the importance of linting, recommending the use of `flake8` to ensure adherence to PEP8 standards. The guide also provides instructions on configuring `flake8` in editors like VS Code, including setting the maximum line length to 120 characters. Additionally, it outlines best practices for organizing imports and structuring code, advocating for the use of docstrings and comments to enhance code readability and maintainability."
  },
  {
    "title": "Transparent Publication: Lessons Learned",
    "year": 2021,
    "link": "https://ta_alex.pages.rwth-aachen.de/action-items/action-items/29_datapub/",
    "measure": "Alex",
    "authors": "Michaela Leštáková, Kevin Logan",
    "abstract": "The webpage titled \"Transparent Publication: Lessons Learned\" discusses the challenges and experiences of two engineering science researchers in implementing research data management practices during the publication process. It emphasizes the importance of making datasets and software associated with a manuscript findable and accessible to ensure transparency. The authors describe their approach to unwrapping the \"wool yarn ball\" of data and code that often accompanies engineering manuscripts, aiming to make these elements transparent to readers and reviewers. They outline key entities to be made findable and accessible, including measurement results, aggregated results, validation and analysis code, test rig/model setup, and component characteristics. The use case presented is based on the publication:\n\n> Logan, K.T.; Leštáková, M.; Thiessen, N.; Engels, J.I.; Pelz, P.F. Water Distribution in a Socio-Technical System: Resilience Assessment for Critical Events Causing Demand Relocation. Water 2021, 13, 2062.\n\nThe authors share their experiences and lessons learned in making these entities findable and accessible, contributing to the broader goal of transparent publication in engineering sciences."
  },
  {
    "title": "Unit Test Workshop",
    "year": 2022,
    "link": "https://ta_alex.pages.rwth-aachen.de/action-items/action-items/54_unit-test-workshop/",
    "measure": "Alex",
    "authors": "Michaela Leštáková, Kevin Logan, Daniele Inturri",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "sofirPY als Best-Practice",
    "year": 2022,
    "link": "https://git.rwth-aachen.de/sofirpy/sofirpy",
    "measure": "Alex",
    "authors": "Daniele Inturri",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Conference paper: Data Management as an Enabler of Sustainability – Discussion Using the Example of a Digital Data Sheet",
    "year": 2022,
    "link": "https://tubiblio.ulb.tu-darmstadt.de/133071/",
    "measure": "Alex",
    "authors": "Logan, Kevin ; Meck, Marvin ; Preuß, N. ; Wetterich, Philipp ; Pelz, P. F.\nSchmitz, Katharina",
    "abstract": "I'm unable to locate an abstract for the document at ([tubiblio.ulb.tu-darmstadt.de](https://tubiblio.ulb.tu-darmstadt.de/143882/?utm_source=openai))."
  },
  {
    "title": "FAIR data boxes demonstrator",
    "year": 2022,
    "link": "https://tudatalib.ulb.tu-darmstadt.de/handle/tudatalib/3610.2",
    "measure": "Alex",
    "authors": "Nils Preuß",
    "abstract": "The dataset titled \"FAIR data box demonstrator\" provides example datasets demonstrating the implementation of FAIR data containers (\"FAIR data box\"). Primary data is contained in the form of numeric multidimensional arrays (hdf5); semantic metadata (serialized RDF) is embedded, describing the numeric arrays using fragment identifiers; semantic metadata can be exported to external catalogues, databases, lookup-services, etc. by using the repository handle (including file name and extension) as @base argument when parsing then serializing the embedded metadata."
  },
  {
    "title": "Press article about RDM in experiments",
    "year": 2023,
    "link": "https://www.sueddeutsche.de/wissen/nationale-forschungsdateninfrastruktur-daten-forschung-nfdi-1.6016012",
    "measure": "Alex",
    "authors": "Canan Hastik, Peter Pelz",
    "abstract": "Die Nationale Forschungsdateninfrastruktur (NFDI) ist ein bundesweites Netzwerk, das darauf abzielt, Forschungsdaten aus verschiedenen Disziplinen systematisch zu erschließen, zu sichern und zugänglich zu machen. Ein zentrales Ziel der NFDI ist es, die Auffindbarkeit, Nachvollziehbarkeit und Reproduzierbarkeit von Forschungsdaten zu verbessern, indem eine Infrastruktur und Werkzeuge bereitgestellt werden, die es Forschenden ermöglichen, ihre Daten standardisiert zu speichern. ([nachrichten.idw-online.de](https://nachrichten.idw-online.de/2022/11/08/ude-leitet-konsortium-nationale-forschungsdateninfrastruktur-fuer-die-informatik?utm_source=openai))\n\nEin Beispiel für die Umsetzung dieser Ziele ist das Konsortium NFDIxCS, das unter der Leitung von Prof. Dr. Michael Goedicke von der Universität Duisburg-Essen aufgebaut wird. Dieses Konsortium konzentriert sich auf die Informatik und entwickelt Tools und Infrastrukturen zur standardisierten Speicherung von Informatikdaten, einschließlich der zugehörigen Metadaten sowie der entsprechenden Software und Kontext- und Ausführungsinformationen. ([uni-due.de](https://www.uni-due.de/rds/rds_nfdi.php?utm_source=openai))\n\nDie NFDI wird von Bund und Ländern bis 2028 mit jährlich bis zu 90 Millionen Euro gefördert. Die Deutsche Forschungsgemeinschaft (DFG) koordiniert den Aufbau der NFDI und stellt Informationen zu Förderkriterien und organisatorischen Fragen bereit. ([dfg.de](https://www.dfg.de/de/foerderung/antrag-foerderprozess/faq/nfdi?utm_source=openai))\n\nInsgesamt zielt die NFDI darauf ab, eine nachhaltige und vernetzte Forschungsdateninfrastruktur in Deutschland zu etablieren, die den Austausch und die Wiederverwendung von Daten über Fachgrenzen hinweg erleichtert und somit die Wissenschaft voranbringt."
  },
  {
    "title": "pyKraken-Bibliothek zur Strukturierung von Daten mit Metadaten unter Python und dem Export in HDF5 und JSON",
    "year": 2022,
    "link": "https://git.rwth-aachen.de/fst-tuda/public/pykkn",
    "measure": "A-3-3, A-2-2, A-2-3,A-2-4, \t\t_x000D_\n",
    "authors": "Ilyass Afkir, Berk Calabakan, Konstantin Repp, Stefan Andreas Sauter, Bastian Tigges, Zhichao Zhang",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "PIA - A Concept for a Personal Information Assistant forData Analysis and Machine Learning in industrialapplication",
    "year": 2023,
    "link": "https://preprints.inggrid.org/repository/view/15/",
    "measure": "A-2-2,A-4-4",
    "authors": "Christopher Schnur, Tanja Dorst, Kapil Sajjan Deshmukh, Sarah Zimmer, Philipp Litzenburger, Tizian Schneider, Lennard Margies, Rainer Müller, Andreas Schütze",
    "abstract": "A database with high-quality data must be given to fully use the potential of Artificial Intelligence (AI). Especially in small and medium-sized companies with little experience with AI, the underlying database quality is often insufficient. This results in an increased manual effort to process the data before using AI. In this contribution, the authors developed a concept to enable inexperienced users to perform a first data analysis project with machine learning and record data with high quality. The concept comprises three modules: accessibility of (meta)data and knowledge, measurement and data planning, and data analysis. Furthermore, the concept was implemented as a front-end demonstrator on the example of an assembly station and published on the GitHub platform for potential users to test and review the concept."
  },
  {
    "title": "SOFIRpy: Co-Simulation Of Functional Mock-up Units (FMU) with Integrated Research Data Management ",
    "year": 2022,
    "link": "https://git.rwth-aachen.de/sofirpy/sofirpy",
    "measure": "A-2-2,-3,-4",
    "authors": "Daniele Inturri ",
    "abstract": "SOFIRpy is a Python package developed as a reference implementation to demonstrate best practices in packaging research software for project applications. The project is archived and read-only, with its repository available at [https://git.rwth-aachen.de/sofirpy/sofirpy](https://git.rwth-aachen.de/sofirpy/sofirpy). The package is licensed under the MIT License. ([git.rwth-aachen.de](https://git.rwth-aachen.de/sofirpy/sofirpy/-/blob/d173a9521827c3ee60ae0c31ce20ad6b55d5724e/LICENSE?utm_source=openai))"
  },
  {
    "title": "plotID - a toolkit for connecting research data and visualization",
    "year": 2023,
    "link": "https://www.inggrid.org/article/id/3632/",
    "measure": "A-2-2",
    "authors": "Martin Hock, Hannes Mayr , Manuela Richter , Jan Lemmer , Peter Pelz",
    "abstract": "While visualizations can carry a vast amount of information compared to text and are often used for validation, references to data and metadata resulting in these visualizations are not common. To provide such references, the software plotID provides two key modules that strive to seamlessly integrate into a generic, Python-based research workflow. The module tagplot generates or accepts a unique ID and anchors it (visibly) as a reference to a figure or picture. The module publish exports the figure along with the data, code and parameters used in its creation into folders named by the reference ID for later reuse. The tools work to provide aid in research data management with simple base functionality as opposed to encompassing management frameworks. Later features and improvements will expand the scope and applicability to other programming environments."
  },
  {
    "title": "Module Communication in Experimental Applications",
    "year": 2023,
    "link": "https://ta_alex.pages.rwth-aachen.de/action-items/action-items/module-communication/",
    "measure": "A-1-2",
    "authors": " Michaela Leštáková, Nils Preuss, Christopher Liehr ",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "FieldCompare: a Python package for regression testing simulation results",
    "year": 2023,
    "link": "https://doi.org/10.21105/joss.04905",
    "measure": NaN,
    "authors": NaN,
    "abstract": "I couldn't find an abstract for the article titled \"fieldcompare: A Python package for regression testing simulation results\" published in the Journal of Open Source Software."
  },
  {
    "title": "Building a Data Transfer Federation between Research Centers",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000174313",
    "measure": "S4",
    "authors": "Mozhdeh Farhadi, Serge Sushkov Evdoshenko, Andreas Petzold",
    "abstract": "Cross-site collaboration between research centers is becoming increasingly crucial, with researchers accessing storage or computing resources from other institutions. However, this collaboration results in the need for large data transfers between different storage systems for computation or archival purposes, which can be a challenging and time-consuming task. To address this need, the Steinbuch Centre for Computing (SCC) at Karlsruhe Institute of Technology (KIT) designed a data transfer federation in the context of NFDI4Ing project, base services-S4:repositories & storage. A data transfer federation is a collaboration of storage providers across multiple organizations, to enable access to data with federated identities and automated, scalable data access and data transfers between the storage systems. Our proposed federation allows researchers to access and transfer data between different storage systems using their home organization's user account, based on their access rights to the resources in a collaborative project. The storage systems in a federation are either dedicated large-scale systems or systems associated with High-Performance Computing (HPC).\n\nAt SCC, we have integrated our Large Scale Data Facility: Online Storage (LSDF OS) [1] with WebDAV [2] protocol and OAuth2 [3] authentication to enable access of third-party applications to the storage service. Beyond improved support for programmatic access using OAuth2, the WebDAV server enables users to inspect the LSDF OS filesystem via their web browser. For enabling data movement, we have deployed an instance of the File Transfer Service (FTS) [4] on-premises and integrated it with our identity provider (IdP). FTS is a low-level data management service that orchestrates reliable bulk transfer of files from one storage endpoint to another. It is an open-source software developed by CERN that distributes the majority of the Large Hadron Collider (LHC) data across the Worldwide LHC Computing Grid (WLCG) infrastructure. However, FTS is designed to be used with one identity provider, whereas in a federation, more than one IdP is involved. To address this limitation, we have designed a central IdP to issue tokens that are recognizable by the downstream identity providers which manage users’ access to their corresponding storage service in the federation. At each storage service, tokens issued by the central IdP are resolved to the corresponding user identity at the local IdP via a mapping policy. To achieve this, a unified approach in the federation regarding the information included in the token is necessary. In conclusion, the data transfer federation enables users to have seamless access to a wider range of resources, thereby simplifying collaboration between research centers.\n\n[1] https://www.scc.kit.edu/forschung/11843.php\n\n[2] https://www.ietf.org/rfc/rfc4918.txt\n\n[3] https://datatracker.ietf.org/doc/html/rfc6749\n\n[4] A. A. Ayllon et al, FTS3: New Data Movement Service For WLCG, J. Phys.: Conf. Ser. 513 032081 (2014)"
  },
  {
    "title": "Fraunhofer Bibliography Evaluation Scripts",
    "year": 2023,
    "link": "https://gitlab.ulb.tu-darmstadt.de/nfdi4ing-public/bibliography-evaluation",
    "measure": "S-7",
    "authors": "Marvin Gusen",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Integrating custom constitutive models into FEniCSx: A versatile approach and case studies",
    "year": 2024,
    "link": "https://zenodo.org/records/13980989",
    "measure": "Betty",
    "authors": "Unger, Jörg",
    "abstract": "The development and integration of user-defined constitutive relationships into finite element (FE) tools using standardized interfaces play a pivotal role in advancing the capabilities of FE solvers for structural mechanics applications. While commercial FE solvers like Abaqus and Ansys have designed their interfaces to provide custom stresses, tangents, and updated history variables, the open-source solver FEniCSx remains efficient only when the constitutive update has an analytical representation. This restricts the application of FEniCSx for non-linear structural mechanics.\n\nSince FEniCSx has become a powerful and popular open-source tool for solving partial differential equations, particularly due to its automatic computation of Hessians, we aim to develop a generalized interface to enhance its capability for constitutive modeling. This approach will address complex constitutive equations that require iterative solutions at the quadrature point level. Specific implementation challenges, such as using return-mapping procedures, can then be managed commonly. The provided interface for custom constitutive models offers a versatile way to implement them in various languages, including C++, Python, Rust, and Fortran. Finally, using the example of UMATs for viscoplastic models, we demonstrate how available user subroutines can be incorporated into the interface while maintaining computational performance of FEniCSx comparable to that of Abaqus."
  },
  {
    "title": "Harvester Curator",
    "year": 2024,
    "link": "https://github.com/SimTech-Research-Data-Management/harvester-curator",
    "measure": "Betty",
    "authors": "Sarbani Roy",
    "abstract": "Error: list index out of range"
  },
  {
    "title": "Community-based RDM Trainings in the engineering sciences – experiences and results from the exchange",
    "year": 2024,
    "link": "https://doi.org/10.5281/zenodo.14288087 ",
    "measure": "S-6",
    "authors": "Christian Langenbach, Kerstin Wedlich, Mario Moser, et al.",
    "abstract": "In NFDI4Ing, a community-based approach is practiced for developing RDM trainings specific for the engineering sciences. In this talk, we will reflect the regular monthly collaboration with the community. We share results from this exchange and highlight the benefits."
  },
  {
    "title": "Building a Data Transfer Federation",
    "year": 2023,
    "link": "https://doi.org/10.5445/IR/1000177013",
    "measure": "S4",
    "authors": "Mozhdeh Farhadi, Paul Skopnik",
    "abstract": "The Data Transfer Federation allows researchers to access and transfer data between different storage systems using their home organization's user account, based on their access rights to the resources in a collaborative project. The storage systems in a federation are either dedicated large-scale systems or systems associated with High-Performance Computing (HPC). At SCC, we have integrated our Large Scale Data Facility: Online Storage (LSDF OS) [1] with WebDAV [2] protocol and OAuth2 [3] authentication to enable access of third-party applications to the storage service. Beyond improved support for programmatic access using OAuth2, the WebDAV server enables users to inspect the LSDF OS filesystem via their web browser. For enabling data movement, we have deployed an instance of the File Transfer Service (FTS) [4] on-premises and integrated it with our identity provider (IdP). FTS is a low-level data management service that orchestrates reliable bulk transfer of files from one storage endpoint to another. It is an open-source software developed by CERN that distributes the majority of the Large Hadron Collider (LHC) data across the Worldwide LHC Computing Grid (WLCG) infrastructure. However, FTS is designed to be used with one identity provider, whereas in a federation, more than one IdP is involved. To address this limitation, we have designed a central IdP to issue tokens that are recognizable by the downstream identity providers which manage users’ access to their corresponding storage service in the federation. At each storage service, tokens issued by the central IdP are resolved to the corresponding user identity at the local IdP via a mapping policy. To achieve this, a unified approach in the federation regarding the information included in the token is necessary. In conclusion, the data transfer federation enables users to have seamless access to a wider range of resources, thereby simplifying collaboration between research centers. [1] https://www.scc.kit.edu/forschung/11843.php [2] https://www.ietf.org/rfc/rfc4918.txt [3] https://datatracker.ietf.org/doc/html/rfc6749 [4] A. A. Ayllon et al, FTS3: New Data Movement Service For WLCG, J. Phys.: Conf. Ser. 513 032081 (2014)"
  },
  {
    "title": "Research Data Management in Simulation Science: Infrastructure, Tools, and Applications",
    "year": 2024,
    "link": "https://doi.org/10.1007/s13222-024-00475-4",
    "measure": "Betty",
    "authors": "Bernd Flemisch, Sarbani Roy",
    "abstract": "Research Data Management (RDM) has gained significant traction in recent years, being essential to allowing research data to be, e.g., findable, accessible, interoperable, and reproducible (FAIR), thereby fostering collaboration or accelerating scientific findings. We present solutions for RDM developed within the DFG-Funded Cluster of Excellence EXC2075 Data-Integrated Simulation Science (SimTech). After an introduction to the scientific context and challenges faced by simulation scientists, we outline the general data management infrastructure and present tools that address these challenges. Exemplary domain applications demonstrate the use and benefits of the proposed data management software solutions. These are complemented by additional measures for enablement and dissemination to foster the adoption of these techniques."
  },
  {
    "title": "Hensel, T., & Wermbter, K. (2025). NFDI4ING Community Survey 2024 [Data set].",
    "year": 2025,
    "link": " https://doi.org/10.5281/zenodo.14614243 ",
    "measure": "CC-3-2",
    "authors": "Katja Wermbter, Tom Hensel",
    "abstract": "The dataset titled \"NFDI4ING Community Survey 2024\" includes the questionnaire and anonymized raw data from a survey conducted between September 27, 2024, and December 31, 2024. The survey covered topics such as Research Data Management (RDM) knowledge and application, need for services and support, data and software, workflow and strategy, governance concepts in the engineering sciences, and socio-economic information. The authors acknowledge the support of the Federal Government and the Heads of Government of the Länder, as well as the Joint Science Conference (GWK), within the framework of the NFDI4Ing consortium (German Research Foundation (DFG) - project number 442146713)."
  },
  {
    "title": "Aufgaben und Tools für den digitalen FDM-Assistenten 'Jarves' – Joint Assistant for Research in Versatile Engineering Services",
    "year": 2023,
    "link": "DOI: 10.5281/ZENODO.8188422",
    "measure": "Frank",
    "authors": "Robrecht, M.",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "Ontology Mappings",
    "year": 2023,
    "link": "DOI: 10.5281/ZENODO.8238012",
    "measure": "S-3-2",
    "authors": "Nenad Krdzavac, N. ; Engel, F.",
    "abstract": "No valid DOI/link"
  },
  {
    "title": "The NFDI4Ing Terminology Service Sandbox",
    "year": 2023,
    "link": "DOI: 10.5281/ZENODO.8233897",
    "measure": "S-3-2",
    "authors": "Engel, F.",
    "abstract": "No valid DOI/link"
  }
]